### Terraform Plan Results

#### GitHub OIDC Stack ✅
**Status:** Success

<details><summary>Show Plan</summary>

```hcl
Error reading plan: ENOENT: no such file or directory, open 'environments/aws/root/deployment/github-oidc/tfplan.txt'
```

</details>

#### Dev Infrastructure (VPC + EKS Clusters) ✅
**Status:** Success

<details><summary>Show Plan</summary>

```hcl
22:23:25.097 STDOUT terraform: Terraform used the selected providers to generate the following execution
22:23:25.097 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
22:23:25.098 STDOUT terraform:   + create
22:23:25.098 STDOUT terraform:  <= read (data resources)
22:23:25.098 STDOUT terraform: Terraform will perform the following actions:
22:23:25.098 STDOUT terraform:   # module.eks_apps.data.tls_certificate.cluster will be read during apply
22:23:25.098 STDOUT terraform:   # (config refers to values not yet known)
22:23:25.098 STDOUT terraform:  <= data "tls_certificate" "cluster" {
22:23:25.098 STDOUT terraform:       + certificates = (known after apply)
22:23:25.098 STDOUT terraform:       + id           = (known after apply)
22:23:25.098 STDOUT terraform:       + url          = (known after apply)
22:23:25.098 STDOUT terraform:     }
22:23:25.098 STDOUT terraform:   # module.eks_apps.aws_eks_cluster.main will be created
22:23:25.098 STDOUT terraform:   + resource "aws_eks_cluster" "main" {
22:23:25.098 STDOUT terraform:       + arn                           = (known after apply)
22:23:25.098 STDOUT terraform:       + bootstrap_self_managed_addons = true
22:23:25.098 STDOUT terraform:       + certificate_authority         = (known after apply)
22:23:25.098 STDOUT terraform:       + cluster_id                    = (known after apply)
22:23:25.098 STDOUT terraform:       + created_at                    = (known after apply)
22:23:25.098 STDOUT terraform:       + deletion_protection           = (known after apply)
22:23:25.098 STDOUT terraform:       + endpoint                      = (known after apply)
22:23:25.098 STDOUT terraform:       + id                            = (known after apply)
22:23:25.098 STDOUT terraform:       + identity                      = (known after apply)
22:23:25.098 STDOUT terraform:       + name                          = "dev-apps-cluster"
22:23:25.098 STDOUT terraform:       + platform_version              = (known after apply)
22:23:25.098 STDOUT terraform:       + region                        = "eu-west-1"
22:23:25.098 STDOUT terraform:       + role_arn                      = (known after apply)
22:23:25.098 STDOUT terraform:       + status                        = (known after apply)
22:23:25.098 STDOUT terraform:       + tags                          = {
22:23:25.098 STDOUT terraform:           + "Cluster"     = "apps-cluster"
22:23:25.098 STDOUT terraform:           + "Environment" = "dev"
22:23:25.098 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.098 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.098 STDOUT terraform:           + "Purpose"     = "application-workloads"
22:23:25.098 STDOUT terraform:         }
22:23:25.098 STDOUT terraform:       + tags_all                      = {
22:23:25.098 STDOUT terraform:           + "Cluster"     = "apps-cluster"
22:23:25.099 STDOUT terraform:           + "Environment" = "dev"
22:23:25.099 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.099 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.099 STDOUT terraform:           + "Purpose"     = "application-workloads"
22:23:25.099 STDOUT terraform:         }
22:23:25.099 STDOUT terraform:       + version                       = "1.34"
22:23:25.099 STDOUT terraform:       + access_config (known after apply)
22:23:25.099 STDOUT terraform:       + compute_config (known after apply)
22:23:25.099 STDOUT terraform:       + control_plane_scaling_config (known after apply)
22:23:25.099 STDOUT terraform:       + kubernetes_network_config (known after apply)
22:23:25.099 STDOUT terraform:       + storage_config (known after apply)
22:23:25.099 STDOUT terraform:       + upgrade_policy (known after apply)
22:23:25.099 STDOUT terraform:       + vpc_config {
22:23:25.099 STDOUT terraform:           + cluster_security_group_id = (known after apply)
22:23:25.099 STDOUT terraform:           + endpoint_private_access   = true
22:23:25.099 STDOUT terraform:           + endpoint_public_access    = true
22:23:25.099 STDOUT terraform:           + public_access_cidrs       = (known after apply)
22:23:25.099 STDOUT terraform:           + security_group_ids        = (known after apply)
22:23:25.099 STDOUT terraform:           + subnet_ids                = (known after apply)
22:23:25.099 STDOUT terraform:           + vpc_id                    = (known after apply)
22:23:25.099 STDOUT terraform:         }
22:23:25.099 STDOUT terraform:     }
22:23:25.099 STDOUT terraform:   # module.eks_apps.aws_eks_fargate_profile.app_namespaces["default"] will be created
22:23:25.099 STDOUT terraform:   + resource "aws_eks_fargate_profile" "app_namespaces" {
22:23:25.099 STDOUT terraform:       + arn                    = (known after apply)
22:23:25.099 STDOUT terraform:       + cluster_name           = "dev-apps-cluster"
22:23:25.099 STDOUT terraform:       + fargate_profile_name   = "dev-apps-cluster-default"
22:23:25.099 STDOUT terraform:       + id                     = (known after apply)
22:23:25.099 STDOUT terraform:       + pod_execution_role_arn = (known after apply)
22:23:25.099 STDOUT terraform:       + region                 = "eu-west-1"
22:23:25.099 STDOUT terraform:       + status                 = (known after apply)
22:23:25.099 STDOUT terraform:       + subnet_ids             = (known after apply)
22:23:25.099 STDOUT terraform:       + tags                   = {
22:23:25.099 STDOUT terraform:           + "Cluster"     = "apps-cluster"
22:23:25.099 STDOUT terraform:           + "Environment" = "dev"
22:23:25.099 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.100 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.100 STDOUT terraform:           + "Purpose"     = "application-workloads"
22:23:25.100 STDOUT terraform:         }
22:23:25.100 STDOUT terraform:       + tags_all               = {
22:23:25.100 STDOUT terraform:           + "Cluster"     = "apps-cluster"
22:23:25.100 STDOUT terraform:           + "Environment" = "dev"
22:23:25.100 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.100 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.100 STDOUT terraform:           + "Purpose"     = "application-workloads"
22:23:25.100 STDOUT terraform:         }
22:23:25.100 STDOUT terraform:       + selector {
22:23:25.100 STDOUT terraform:           + namespace = "default"
22:23:25.100 STDOUT terraform:         }
22:23:25.100 STDOUT terraform:     }
22:23:25.100 STDOUT terraform:   # module.eks_apps.aws_eks_fargate_profile.app_namespaces["production"] will be created
22:23:25.100 STDOUT terraform:   + resource "aws_eks_fargate_profile" "app_namespaces" {
22:23:25.100 STDOUT terraform:       + arn                    = (known after apply)
22:23:25.100 STDOUT terraform:       + cluster_name           = "dev-apps-cluster"
22:23:25.100 STDOUT terraform:       + fargate_profile_name   = "dev-apps-cluster-production"
22:23:25.100 STDOUT terraform:       + id                     = (known after apply)
22:23:25.100 STDOUT terraform:       + pod_execution_role_arn = (known after apply)
22:23:25.100 STDOUT terraform:       + region                 = "eu-west-1"
22:23:25.100 STDOUT terraform:       + status                 = (known after apply)
22:23:25.100 STDOUT terraform:       + subnet_ids             = (known after apply)
22:23:25.100 STDOUT terraform:       + tags                   = {
22:23:25.100 STDOUT terraform:           + "Cluster"     = "apps-cluster"
22:23:25.100 STDOUT terraform:           + "Environment" = "dev"
22:23:25.100 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.100 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.100 STDOUT terraform:           + "Purpose"     = "application-workloads"
22:23:25.100 STDOUT terraform:         }
22:23:25.100 STDOUT terraform:       + tags_all               = {
22:23:25.100 STDOUT terraform:           + "Cluster"     = "apps-cluster"
22:23:25.100 STDOUT terraform:           + "Environment" = "dev"
22:23:25.100 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.100 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.100 STDOUT terraform:           + "Purpose"     = "application-workloads"
22:23:25.100 STDOUT terraform:         }
22:23:25.100 STDOUT terraform:       + selector {
22:23:25.100 STDOUT terraform:           + namespace = "production"
22:23:25.101 STDOUT terraform:         }
22:23:25.101 STDOUT terraform:     }
22:23:25.101 STDOUT terraform:   # module.eks_apps.aws_eks_fargate_profile.app_namespaces["staging"] will be created
22:23:25.101 STDOUT terraform:   + resource "aws_eks_fargate_profile" "app_namespaces" {
22:23:25.101 STDOUT terraform:       + arn                    = (known after apply)
22:23:25.101 STDOUT terraform:       + cluster_name           = "dev-apps-cluster"
22:23:25.101 STDOUT terraform:       + fargate_profile_name   = "dev-apps-cluster-staging"
22:23:25.101 STDOUT terraform:       + id                     = (known after apply)
22:23:25.101 STDOUT terraform:       + pod_execution_role_arn = (known after apply)
22:23:25.101 STDOUT terraform:       + region                 = "eu-west-1"
22:23:25.101 STDOUT terraform:       + status                 = (known after apply)
22:23:25.101 STDOUT terraform:       + subnet_ids             = (known after apply)
22:23:25.101 STDOUT terraform:       + tags                   = {
22:23:25.101 STDOUT terraform:           + "Cluster"     = "apps-cluster"
22:23:25.101 STDOUT terraform:           + "Environment" = "dev"
22:23:25.101 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.101 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.101 STDOUT terraform:           + "Purpose"     = "application-workloads"
22:23:25.101 STDOUT terraform:         }
22:23:25.101 STDOUT terraform:       + tags_all               = {
22:23:25.101 STDOUT terraform:           + "Cluster"     = "apps-cluster"
22:23:25.101 STDOUT terraform:           + "Environment" = "dev"
22:23:25.101 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.101 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.101 STDOUT terraform:           + "Purpose"     = "application-workloads"
22:23:25.101 STDOUT terraform:         }
22:23:25.101 STDOUT terraform:       + selector {
22:23:25.101 STDOUT terraform:           + namespace = "staging"
22:23:25.101 STDOUT terraform:         }
22:23:25.101 STDOUT terraform:     }
22:23:25.101 STDOUT terraform:   # module.eks_apps.aws_eks_fargate_profile.kube_system will be created
22:23:25.101 STDOUT terraform:   + resource "aws_eks_fargate_profile" "kube_system" {
22:23:25.101 STDOUT terraform:       + arn                    = (known after apply)
22:23:25.101 STDOUT terraform:       + cluster_name           = "dev-apps-cluster"
22:23:25.101 STDOUT terraform:       + fargate_profile_name   = "dev-apps-cluster-kube-system"
22:23:25.101 STDOUT terraform:       + id                     = (known after apply)
22:23:25.101 STDOUT terraform:       + pod_execution_role_arn = (known after apply)
22:23:25.101 STDOUT terraform:       + region                 = "eu-west-1"
22:23:25.101 STDOUT terraform:       + status                 = (known after apply)
22:23:25.102 STDOUT terraform:       + subnet_ids             = (known after apply)
22:23:25.102 STDOUT terraform:       + tags                   = {
22:23:25.102 STDOUT terraform:           + "Cluster"     = "apps-cluster"
22:23:25.102 STDOUT terraform:           + "Environment" = "dev"
22:23:25.102 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.102 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.102 STDOUT terraform:           + "Purpose"     = "application-workloads"
22:23:25.102 STDOUT terraform:         }
22:23:25.102 STDOUT terraform:       + tags_all               = {
22:23:25.102 STDOUT terraform:           + "Cluster"     = "apps-cluster"
22:23:25.102 STDOUT terraform:           + "Environment" = "dev"
22:23:25.102 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.102 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.102 STDOUT terraform:           + "Purpose"     = "application-workloads"
22:23:25.102 STDOUT terraform:         }
22:23:25.102 STDOUT terraform:       + selector {
22:23:25.102 STDOUT terraform:           + namespace = "kube-system"
22:23:25.102 STDOUT terraform:         }
22:23:25.102 STDOUT terraform:     }
22:23:25.102 STDOUT terraform:   # module.eks_apps.aws_iam_openid_connect_provider.cluster will be created
22:23:25.102 STDOUT terraform:   + resource "aws_iam_openid_connect_provider" "cluster" {
22:23:25.102 STDOUT terraform:       + arn             = (known after apply)
22:23:25.102 STDOUT terraform:       + client_id_list  = [
22:23:25.102 STDOUT terraform:           + "sts.amazonaws.com",
22:23:25.102 STDOUT terraform:         ]
22:23:25.102 STDOUT terraform:       + id              = (known after apply)
22:23:25.102 STDOUT terraform:       + tags            = {
22:23:25.102 STDOUT terraform:           + "Cluster"     = "apps-cluster"
22:23:25.102 STDOUT terraform:           + "Environment" = "dev"
22:23:25.102 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.102 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.102 STDOUT terraform:           + "Purpose"     = "application-workloads"
22:23:25.102 STDOUT terraform:         }
22:23:25.102 STDOUT terraform:       + tags_all        = {
22:23:25.102 STDOUT terraform:           + "Cluster"     = "apps-cluster"
22:23:25.102 STDOUT terraform:           + "Environment" = "dev"
22:23:25.102 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.102 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.102 STDOUT terraform:           + "Purpose"     = "application-workloads"
22:23:25.102 STDOUT terraform:         }
22:23:25.102 STDOUT terraform:       + thumbprint_list = (known after apply)
22:23:25.102 STDOUT terraform:       + url             = (known after apply)
22:23:25.102 STDOUT terraform:     }
22:23:25.103 STDOUT terraform:   # module.eks_apps.aws_iam_policy.aws_load_balancer_controller[0] will be created
22:23:25.103 STDOUT terraform:   + resource "aws_iam_policy" "aws_load_balancer_controller" {
22:23:25.103 STDOUT terraform:       + arn              = (known after apply)
22:23:25.103 STDOUT terraform:       + attachment_count = (known after apply)
22:23:25.103 STDOUT terraform:       + description      = "IAM policy for AWS Load Balancer Controller"
22:23:25.103 STDOUT terraform:       + id               = (known after apply)
22:23:25.103 STDOUT terraform:       + name             = "dev-apps-cluster-aws-lb-controller-policy"
22:23:25.103 STDOUT terraform:       + name_prefix      = (known after apply)
22:23:25.103 STDOUT terraform:       + path             = "/"
22:23:25.103 STDOUT terraform:       + policy           = jsonencode(
22:23:25.103 STDOUT terraform:             {
22:23:25.103 STDOUT terraform:               + Statement = [
22:23:25.103 STDOUT terraform:                   + {
22:23:25.103 STDOUT terraform:                       + Action    = [
22:23:25.103 STDOUT terraform:                           + "iam:CreateServiceLinkedRole",
22:23:25.103 STDOUT terraform:                         ]
22:23:25.103 STDOUT terraform:                       + Condition = {
22:23:25.103 STDOUT terraform:                           + StringEquals = {
22:23:25.103 STDOUT terraform:                               + "iam:AWSServiceName" = "elasticloadbalancing.amazonaws.com"
22:23:25.103 STDOUT terraform:                             }
22:23:25.103 STDOUT terraform:                         }
22:23:25.103 STDOUT terraform:                       + Effect    = "Allow"
22:23:25.103 STDOUT terraform:                       + Resource  = "*"
22:23:25.103 STDOUT terraform:                     },
22:23:25.103 STDOUT terraform:                   + {
22:23:25.103 STDOUT terraform:                       + Action   = [
22:23:25.103 STDOUT terraform:                           + "ec2:DescribeAccountAttributes",
22:23:25.103 STDOUT terraform:                           + "ec2:DescribeAddresses",
22:23:25.103 STDOUT terraform:                           + "ec2:DescribeAvailabilityZones",
22:23:25.103 STDOUT terraform:                           + "ec2:DescribeInternetGateways",
22:23:25.103 STDOUT terraform:                           + "ec2:DescribeVpcs",
22:23:25.103 STDOUT terraform:                           + "ec2:DescribeVpcPeeringConnections",
22:23:25.103 STDOUT terraform:                           + "ec2:DescribeSubnets",
22:23:25.104 STDOUT terraform:                           + "ec2:DescribeSecurityGroups",
22:23:25.104 STDOUT terraform:                           + "ec2:DescribeInstances",
22:23:25.104 STDOUT terraform:                           + "ec2:DescribeNetworkInterfaces",
22:23:25.104 STDOUT terraform:                           + "ec2:DescribeTags",
22:23:25.104 STDOUT terraform:                           + "ec2:GetCoipPoolUsage",
22:23:25.104 STDOUT terraform:                           + "ec2:DescribeCoipPools",
22:23:25.104 STDOUT terraform:                           + "elasticloadbalancing:DescribeLoadBalancers",
22:23:25.104 STDOUT terraform:                           + "elasticloadbalancing:DescribeLoadBalancerAttributes",
22:23:25.104 STDOUT terraform:                           + "elasticloadbalancing:DescribeListeners",
22:23:25.104 STDOUT terraform:                           + "elasticloadbalancing:DescribeListenerCertificates",
22:23:25.104 STDOUT terraform:                           + "elasticloadbalancing:DescribeSSLPolicies",
22:23:25.104 STDOUT terraform:                           + "elasticloadbalancing:DescribeRules",
22:23:25.104 STDOUT terraform:                           + "elasticloadbalancing:DescribeTargetGroups",
22:23:25.104 STDOUT terraform:                           + "elasticloadbalancing:DescribeTargetGroupAttributes",
22:23:25.104 STDOUT terraform:                           + "elasticloadbalancing:DescribeTargetHealth",
22:23:25.104 STDOUT terraform:                           + "elasticloadbalancing:DescribeTags",
22:23:25.104 STDOUT terraform:                         ]
22:23:25.104 STDOUT terraform:                       + Effect   = "Allow"
22:23:25.104 STDOUT terraform:                       + Resource = "*"
22:23:25.104 STDOUT terraform:                     },
22:23:25.104 STDOUT terraform:                   + {
22:23:25.104 STDOUT terraform:                       + Action   = [
22:23:25.104 STDOUT terraform:                           + "cognito-idp:DescribeUserPoolClient",
22:23:25.104 STDOUT terraform:                           + "acm:ListCertificates",
22:23:25.104 STDOUT terraform:                           + "acm:DescribeCertificate",
22:23:25.104 STDOUT terraform:                           + "iam:ListServerCertificates",
22:23:25.104 STDOUT terraform:                           + "iam:GetServerCertificate",
22:23:25.104 STDOUT terraform:                           + "waf-regional:GetWebACL",
22:23:25.104 STDOUT terraform:                           + "waf-regional:GetWebACLForResource",
22:23:25.104 STDOUT terraform:                           + "waf-regional:AssociateWebACL",
22:23:25.104 STDOUT terraform:                           + "waf-regional:DisassociateWebACL",
22:23:25.105 STDOUT terraform:                           + "wafv2:GetWebACL",
22:23:25.105 STDOUT terraform:                           + "wafv2:GetWebACLForResource",
22:23:25.105 STDOUT terraform:                           + "wafv2:AssociateWebACL",
22:23:25.105 STDOUT terraform:                           + "wafv2:DisassociateWebACL",
22:23:25.105 STDOUT terraform:                           + "shield:GetSubscriptionState",
22:23:25.105 STDOUT terraform:                           + "shield:DescribeProtection",
22:23:25.105 STDOUT terraform:                           + "shield:CreateProtection",
22:23:25.105 STDOUT terraform:                           + "shield:DeleteProtection",
22:23:25.105 STDOUT terraform:                         ]
22:23:25.105 STDOUT terraform:                       + Effect   = "Allow"
22:23:25.105 STDOUT terraform:                       + Resource = "*"
22:23:25.105 STDOUT terraform:                     },
22:23:25.105 STDOUT terraform:                   + {
22:23:25.105 STDOUT terraform:                       + Action   = [
22:23:25.105 STDOUT terraform:                           + "ec2:AuthorizeSecurityGroupIngress",
22:23:25.105 STDOUT terraform:                           + "ec2:RevokeSecurityGroupIngress",
22:23:25.105 STDOUT terraform:                         ]
22:23:25.105 STDOUT terraform:                       + Effect   = "Allow"
22:23:25.105 STDOUT terraform:                       + Resource = "*"
22:23:25.105 STDOUT terraform:                     },
22:23:25.105 STDOUT terraform:                   + {
22:23:25.105 STDOUT terraform:                       + Action   = [
22:23:25.105 STDOUT terraform:                           + "ec2:CreateSecurityGroup",
22:23:25.105 STDOUT terraform:                         ]
22:23:25.105 STDOUT terraform:                       + Effect   = "Allow"
22:23:25.105 STDOUT terraform:                       + Resource = "*"
22:23:25.105 STDOUT terraform:                     },
22:23:25.105 STDOUT terraform:                   + {
22:23:25.105 STDOUT terraform:                       + Action    = [
22:23:25.105 STDOUT terraform:                           + "ec2:CreateTags",
22:23:25.105 STDOUT terraform:                         ]
22:23:25.105 STDOUT terraform:                       + Condition = {
22:23:25.105 STDOUT terraform:                           + Null         = {
22:23:25.105 STDOUT terraform:                               + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
22:23:25.105 STDOUT terraform:                             }
22:23:25.105 STDOUT terraform:                           + StringEquals = {
22:23:25.105 STDOUT terraform:                               + "ec2:CreateAction" = "CreateSecurityGroup"
22:23:25.106 STDOUT terraform:                             }
22:23:25.106 STDOUT terraform:                         }
22:23:25.106 STDOUT terraform:                       + Effect    = "Allow"
22:23:25.106 STDOUT terraform:                       + Resource  = "arn:aws:ec2:*:*:security-group/*"
22:23:25.106 STDOUT terraform:                     },
22:23:25.106 STDOUT terraform:                   + {
22:23:25.106 STDOUT terraform:                       + Action    = [
22:23:25.106 STDOUT terraform:                           + "ec2:CreateTags",
22:23:25.106 STDOUT terraform:                           + "ec2:DeleteTags",
22:23:25.106 STDOUT terraform:                         ]
22:23:25.106 STDOUT terraform:                       + Condition = {
22:23:25.106 STDOUT terraform:                           + Null = {
22:23:25.106 STDOUT terraform:                               + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
22:23:25.106 STDOUT terraform:                               + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
22:23:25.106 STDOUT terraform:                             }
22:23:25.106 STDOUT terraform:                         }
22:23:25.106 STDOUT terraform:                       + Effect    = "Allow"
22:23:25.106 STDOUT terraform:                       + Resource  = "arn:aws:ec2:*:*:security-group/*"
22:23:25.106 STDOUT terraform:                     },
22:23:25.106 STDOUT terraform:                   + {
22:23:25.106 STDOUT terraform:                       + Action    = [
22:23:25.106 STDOUT terraform:                           + "ec2:AuthorizeSecurityGroupIngress",
22:23:25.106 STDOUT terraform:                           + "ec2:RevokeSecurityGroupIngress",
22:23:25.106 STDOUT terraform:                           + "ec2:DeleteSecurityGroup",
22:23:25.106 STDOUT terraform:                         ]
22:23:25.106 STDOUT terraform:                       + Condition = {
22:23:25.106 STDOUT terraform:                           + Null = {
22:23:25.106 STDOUT terraform:                               + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
22:23:25.106 STDOUT terraform:                             }
22:23:25.106 STDOUT terraform:                         }
22:23:25.106 STDOUT terraform:                       + Effect    = "Allow"
22:23:25.106 STDOUT terraform:                       + Resource  = "*"
22:23:25.106 STDOUT terraform:                     },
22:23:25.106 STDOUT terraform:                   + {
22:23:25.106 STDOUT terraform:                       + Action    = [
22:23:25.106 STDOUT terraform:                           + "elasticloadbalancing:CreateLoadBalancer",
22:23:25.106 STDOUT terraform:                           + "elasticloadbalancing:CreateTargetGroup",
22:23:25.107 STDOUT terraform:                         ]
22:23:25.107 STDOUT terraform:                       + Condition = {
22:23:25.107 STDOUT terraform:                           + Null = {
22:23:25.107 STDOUT terraform:                               + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
22:23:25.107 STDOUT terraform:                             }
22:23:25.107 STDOUT terraform:                         }
22:23:25.107 STDOUT terraform:                       + Effect    = "Allow"
22:23:25.107 STDOUT terraform:                       + Resource  = "*"
22:23:25.107 STDOUT terraform:                     },
22:23:25.107 STDOUT terraform:                   + {
22:23:25.107 STDOUT terraform:                       + Action   = [
22:23:25.107 STDOUT terraform:                           + "elasticloadbalancing:CreateListener",
22:23:25.107 STDOUT terraform:                           + "elasticloadbalancing:DeleteListener",
22:23:25.107 STDOUT terraform:                           + "elasticloadbalancing:CreateRule",
22:23:25.107 STDOUT terraform:                           + "elasticloadbalancing:DeleteRule",
22:23:25.107 STDOUT terraform:                         ]
22:23:25.107 STDOUT terraform:                       + Effect   = "Allow"
22:23:25.107 STDOUT terraform:                       + Resource = "*"
22:23:25.107 STDOUT terraform:                     },
22:23:25.107 STDOUT terraform:                   + {
22:23:25.107 STDOUT terraform:                       + Action    = [
22:23:25.107 STDOUT terraform:                           + "elasticloadbalancing:AddTags",
22:23:25.107 STDOUT terraform:                           + "elasticloadbalancing:RemoveTags",
22:23:25.107 STDOUT terraform:                         ]
22:23:25.107 STDOUT terraform:                       + Condition = {
22:23:25.107 STDOUT terraform:                           + Null = {
22:23:25.107 STDOUT terraform:                               + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
22:23:25.107 STDOUT terraform:                               + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
22:23:25.107 STDOUT terraform:                             }
22:23:25.107 STDOUT terraform:                         }
22:23:25.107 STDOUT terraform:                       + Effect    = "Allow"
22:23:25.107 STDOUT terraform:                       + Resource  = [
22:23:25.107 STDOUT terraform:                           + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
22:23:25.107 STDOUT terraform:                           + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
22:23:25.107 STDOUT terraform:                           + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
22:23:25.107 STDOUT terraform:                         ]
22:23:25.107 STDOUT terraform:                     },
22:23:25.107 STDOUT terraform:                   + {
22:23:25.107 STDOUT terraform:                       + Action   = [
22:23:25.107 STDOUT terraform:                           + "elasticloadbalancing:AddTags",
22:23:25.107 STDOUT terraform:                           + "elasticloadbalancing:RemoveTags",
22:23:25.107 STDOUT terraform:                         ]
22:23:25.107 STDOUT terraform:                       + Effect   = "Allow"
22:23:25.108 STDOUT terraform:                       + Resource = [
22:23:25.108 STDOUT terraform:                           + "arn:aws:elasticloadbalancing:*:*:listener/net/*/*/*",
22:23:25.108 STDOUT terraform:                           + "arn:aws:elasticloadbalancing:*:*:listener/app/*/*/*",
22:23:25.108 STDOUT terraform:                           + "arn:aws:elasticloadbalancing:*:*:listener-rule/net/*/*/*",
22:23:25.108 STDOUT terraform:                           + "arn:aws:elasticloadbalancing:*:*:listener-rule/app/*/*/*",
22:23:25.108 STDOUT terraform:                         ]
22:23:25.108 STDOUT terraform:                     },
22:23:25.108 STDOUT terraform:                   + {
22:23:25.108 STDOUT terraform:                       + Action    = [
22:23:25.108 STDOUT terraform:                           + "elasticloadbalancing:ModifyLoadBalancerAttributes",
22:23:25.108 STDOUT terraform:                           + "elasticloadbalancing:SetIpAddressType",
22:23:25.108 STDOUT terraform:                           + "elasticloadbalancing:SetSecurityGroups",
22:23:25.108 STDOUT terraform:                           + "elasticloadbalancing:SetSubnets",
22:23:25.108 STDOUT terraform:                           + "elasticloadbalancing:DeleteLoadBalancer",
22:23:25.108 STDOUT terraform:                           + "elasticloadbalancing:ModifyTargetGroup",
22:23:25.108 STDOUT terraform:                           + "elasticloadbalancing:ModifyTargetGroupAttributes",
22:23:25.108 STDOUT terraform:                           + "elasticloadbalancing:DeleteTargetGroup",
22:23:25.108 STDOUT terraform:                         ]
22:23:25.108 STDOUT terraform:                       + Condition = {
22:23:25.108 STDOUT terraform:                           + Null = {
22:23:25.108 STDOUT terraform:                               + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
22:23:25.108 STDOUT terraform:                             }
22:23:25.108 STDOUT terraform:                         }
22:23:25.108 STDOUT terraform:                       + Effect    = "Allow"
22:23:25.108 STDOUT terraform:                       + Resource  = "*"
22:23:25.108 STDOUT terraform:                     },
22:23:25.108 STDOUT terraform:                   + {
22:23:25.108 STDOUT terraform:                       + Action   = [
22:23:25.108 STDOUT terraform:                           + "elasticloadbalancing:RegisterTargets",
22:23:25.108 STDOUT terraform:                           + "elasticloadbalancing:DeregisterTargets",
22:23:25.108 STDOUT terraform:                         ]
22:23:25.108 STDOUT terraform:                       + Effect   = "Allow"
22:23:25.108 STDOUT terraform:                       + Resource = "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*"
22:23:25.108 STDOUT terraform:                     },
22:23:25.108 STDOUT terraform:                   + {
22:23:25.108 STDOUT terraform:                       + Action   = [
22:23:25.108 STDOUT terraform:                           + "elasticloadbalancing:SetWebAcl",
22:23:25.108 STDOUT terraform:                           + "elasticloadbalancing:ModifyListener",
22:23:25.108 STDOUT terraform:                           + "elasticloadbalancing:AddListenerCertificates",
22:23:25.108 STDOUT terraform:                           + "elasticloadbalancing:RemoveListenerCertificates",
22:23:25.108 STDOUT terraform:                           + "elasticloadbalancing:ModifyRule",
22:23:25.108 STDOUT terraform:                         ]
22:23:25.108 STDOUT terraform:                       + Effect   = "Allow"
22:23:25.108 STDOUT terraform:                       + Resource = "*"
22:23:25.108 STDOUT terraform:                     },
22:23:25.108 STDOUT terraform:                 ]
22:23:25.108 STDOUT terraform:               + Version   = "2012-10-17"
22:23:25.108 STDOUT terraform:             }
22:23:25.108 STDOUT terraform:         )
22:23:25.108 STDOUT terraform:       + policy_id        = (known after apply)
22:23:25.108 STDOUT terraform:       + tags             = {
22:23:25.108 STDOUT terraform:           + "Cluster"     = "apps-cluster"
22:23:25.108 STDOUT terraform:           + "Environment" = "dev"
22:23:25.108 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.108 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.108 STDOUT terraform:           + "Purpose"     = "application-workloads"
22:23:25.108 STDOUT terraform:         }
22:23:25.108 STDOUT terraform:       + tags_all         = {
22:23:25.108 STDOUT terraform:           + "Cluster"     = "apps-cluster"
22:23:25.108 STDOUT terraform:           + "Environment" = "dev"
22:23:25.108 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.108 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.108 STDOUT terraform:           + "Purpose"     = "application-workloads"
22:23:25.108 STDOUT terraform:         }
22:23:25.108 STDOUT terraform:     }
22:23:25.108 STDOUT terraform:   # module.eks_apps.aws_iam_role.aws_load_balancer_controller[0] will be created
22:23:25.109 STDOUT terraform:   + resource "aws_iam_role" "aws_load_balancer_controller" {
22:23:25.109 STDOUT terraform:       + arn                   = (known after apply)
22:23:25.109 STDOUT terraform:       + assume_role_policy    = (known after apply)
22:23:25.109 STDOUT terraform:       + create_date           = (known after apply)
22:23:25.109 STDOUT terraform:       + force_detach_policies = false
22:23:25.109 STDOUT terraform:       + id                    = (known after apply)
22:23:25.109 STDOUT terraform:       + managed_policy_arns   = (known after apply)
22:23:25.109 STDOUT terraform:       + max_session_duration  = 3600
22:23:25.109 STDOUT terraform:       + name                  = "dev-apps-cluster-aws-lb-controller"
22:23:25.109 STDOUT terraform:       + name_prefix           = (known after apply)
22:23:25.109 STDOUT terraform:       + path                  = "/"
22:23:25.109 STDOUT terraform:       + tags                  = {
22:23:25.109 STDOUT terraform:           + "Cluster"     = "apps-cluster"
22:23:25.109 STDOUT terraform:           + "Environment" = "dev"
22:23:25.109 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.109 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.109 STDOUT terraform:           + "Purpose"     = "application-workloads"
22:23:25.109 STDOUT terraform:         }
22:23:25.109 STDOUT terraform:       + tags_all              = {
22:23:25.109 STDOUT terraform:           + "Cluster"     = "apps-cluster"
22:23:25.109 STDOUT terraform:           + "Environment" = "dev"
22:23:25.109 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.109 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.109 STDOUT terraform:           + "Purpose"     = "application-workloads"
22:23:25.109 STDOUT terraform:         }
22:23:25.109 STDOUT terraform:       + unique_id             = (known after apply)
22:23:25.109 STDOUT terraform:       + inline_policy (known after apply)
22:23:25.109 STDOUT terraform:     }
22:23:25.109 STDOUT terraform:   # module.eks_apps.aws_iam_role.cluster will be created
22:23:25.109 STDOUT terraform:   + resource "aws_iam_role" "cluster" {
22:23:25.109 STDOUT terraform:       + arn                   = (known after apply)
22:23:25.109 STDOUT terraform:       + assume_role_policy    = jsonencode(
22:23:25.109 STDOUT terraform:             {
22:23:25.109 STDOUT terraform:               + Statement = [
22:23:25.109 STDOUT terraform:                   + {
22:23:25.109 STDOUT terraform:                       + Action    = "sts:AssumeRole"
22:23:25.109 STDOUT terraform:                       + Effect    = "Allow"
22:23:25.109 STDOUT terraform:                       + Principal = {
22:23:25.109 STDOUT terraform:                           + Service = "eks.amazonaws.com"
22:23:25.109 STDOUT terraform:                         }
22:23:25.109 STDOUT terraform:                     },
22:23:25.109 STDOUT terraform:                 ]
22:23:25.109 STDOUT terraform:               + Version   = "2012-10-17"
22:23:25.109 STDOUT terraform:             }
22:23:25.109 STDOUT terraform:         )
22:23:25.109 STDOUT terraform:       + create_date           = (known after apply)
22:23:25.109 STDOUT terraform:       + force_detach_policies = false
22:23:25.109 STDOUT terraform:       + id                    = (known after apply)
22:23:25.109 STDOUT terraform:       + managed_policy_arns   = (known after apply)
22:23:25.109 STDOUT terraform:       + max_session_duration  = 3600
22:23:25.109 STDOUT terraform:       + name                  = "dev-apps-cluster-cluster-role"
22:23:25.109 STDOUT terraform:       + name_prefix           = (known after apply)
22:23:25.109 STDOUT terraform:       + path                  = "/"
22:23:25.109 STDOUT terraform:       + tags                  = {
22:23:25.109 STDOUT terraform:           + "Cluster"     = "apps-cluster"
22:23:25.109 STDOUT terraform:           + "Environment" = "dev"
22:23:25.109 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.109 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.109 STDOUT terraform:           + "Purpose"     = "application-workloads"
22:23:25.109 STDOUT terraform:         }
22:23:25.109 STDOUT terraform:       + tags_all              = {
22:23:25.109 STDOUT terraform:           + "Cluster"     = "apps-cluster"
22:23:25.109 STDOUT terraform:           + "Environment" = "dev"
22:23:25.109 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.109 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.109 STDOUT terraform:           + "Purpose"     = "application-workloads"
22:23:25.109 STDOUT terraform:         }
22:23:25.109 STDOUT terraform:       + unique_id             = (known after apply)
22:23:25.109 STDOUT terraform:       + inline_policy (known after apply)
22:23:25.109 STDOUT terraform:     }
22:23:25.109 STDOUT terraform:   # module.eks_apps.aws_iam_role.fargate will be created
22:23:25.109 STDOUT terraform:   + resource "aws_iam_role" "fargate" {
22:23:25.109 STDOUT terraform:       + arn                   = (known after apply)
22:23:25.109 STDOUT terraform:       + assume_role_policy    = jsonencode(
22:23:25.109 STDOUT terraform:             {
22:23:25.109 STDOUT terraform:               + Statement = [
22:23:25.109 STDOUT terraform:                   + {
22:23:25.109 STDOUT terraform:                       + Action    = "sts:AssumeRole"
22:23:25.110 STDOUT terraform:                       + Effect    = "Allow"
22:23:25.110 STDOUT terraform:                       + Principal = {
22:23:25.110 STDOUT terraform:                           + Service = "eks-fargate-pods.amazonaws.com"
22:23:25.110 STDOUT terraform:                         }
22:23:25.110 STDOUT terraform:                     },
22:23:25.110 STDOUT terraform:                 ]
22:23:25.110 STDOUT terraform:               + Version   = "2012-10-17"
22:23:25.110 STDOUT terraform:             }
22:23:25.110 STDOUT terraform:         )
22:23:25.110 STDOUT terraform:       + create_date           = (known after apply)
22:23:25.110 STDOUT terraform:       + force_detach_policies = false
22:23:25.110 STDOUT terraform:       + id                    = (known after apply)
22:23:25.110 STDOUT terraform:       + managed_policy_arns   = (known after apply)
22:23:25.110 STDOUT terraform:       + max_session_duration  = 3600
22:23:25.110 STDOUT terraform:       + name                  = "dev-apps-cluster-fargate-role"
22:23:25.110 STDOUT terraform:       + name_prefix           = (known after apply)
22:23:25.110 STDOUT terraform:       + path                  = "/"
22:23:25.110 STDOUT terraform:       + tags                  = {
22:23:25.110 STDOUT terraform:           + "Cluster"     = "apps-cluster"
22:23:25.110 STDOUT terraform:           + "Environment" = "dev"
22:23:25.110 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.110 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.110 STDOUT terraform:           + "Purpose"     = "application-workloads"
22:23:25.110 STDOUT terraform:         }
22:23:25.110 STDOUT terraform:       + tags_all              = {
22:23:25.110 STDOUT terraform:           + "Cluster"     = "apps-cluster"
22:23:25.110 STDOUT terraform:           + "Environment" = "dev"
22:23:25.110 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.110 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.110 STDOUT terraform:           + "Purpose"     = "application-workloads"
22:23:25.110 STDOUT terraform:         }
22:23:25.110 STDOUT terraform:       + unique_id             = (known after apply)
22:23:25.110 STDOUT terraform:       + inline_policy (known after apply)
22:23:25.110 STDOUT terraform:     }
22:23:25.110 STDOUT terraform:   # module.eks_apps.aws_iam_role_policy_attachment.aws_load_balancer_controller[0] will be created
22:23:25.110 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "aws_load_balancer_controller" {
22:23:25.110 STDOUT terraform:       + id         = (known after apply)
22:23:25.110 STDOUT terraform:       + policy_arn = (known after apply)
22:23:25.110 STDOUT terraform:       + role       = "dev-apps-cluster-aws-lb-controller"
22:23:25.110 STDOUT terraform:     }
22:23:25.110 STDOUT terraform:   # module.eks_apps.aws_iam_role_policy_attachment.cluster_policy will be created
22:23:25.110 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "cluster_policy" {
22:23:25.110 STDOUT terraform:       + id         = (known after apply)
22:23:25.110 STDOUT terraform:       + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
22:23:25.110 STDOUT terraform:       + role       = "dev-apps-cluster-cluster-role"
22:23:25.110 STDOUT terraform:     }
22:23:25.110 STDOUT terraform:   # module.eks_apps.aws_iam_role_policy_attachment.fargate_pod_execution will be created
22:23:25.110 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "fargate_pod_execution" {
22:23:25.110 STDOUT terraform:       + id         = (known after apply)
22:23:25.110 STDOUT terraform:       + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"
22:23:25.110 STDOUT terraform:       + role       = "dev-apps-cluster-fargate-role"
22:23:25.110 STDOUT terraform:     }
22:23:25.110 STDOUT terraform:   # module.eks_apps.aws_security_group.cluster will be created
22:23:25.110 STDOUT terraform:   + resource "aws_security_group" "cluster" {
22:23:25.110 STDOUT terraform:       + arn                    = (known after apply)
22:23:25.110 STDOUT terraform:       + description            = "Security group for EKS cluster control plane"
22:23:25.110 STDOUT terraform:       + egress                 = [
22:23:25.110 STDOUT terraform:           + {
22:23:25.110 STDOUT terraform:               + cidr_blocks      = [
22:23:25.110 STDOUT terraform:                   + "0.0.0.0/0",
22:23:25.110 STDOUT terraform:                 ]
22:23:25.110 STDOUT terraform:               + description      = "Allow all outbound traffic"
22:23:25.110 STDOUT terraform:               + from_port        = 0
22:23:25.110 STDOUT terraform:               + ipv6_cidr_blocks = []
22:23:25.110 STDOUT terraform:               + prefix_list_ids  = []
22:23:25.110 STDOUT terraform:               + protocol         = "-1"
22:23:25.110 STDOUT terraform:               + security_groups  = []
22:23:25.110 STDOUT terraform:               + self             = false
22:23:25.110 STDOUT terraform:               + to_port          = 0
22:23:25.110 STDOUT terraform:             },
22:23:25.110 STDOUT terraform:         ]
22:23:25.110 STDOUT terraform:       + id                     = (known after apply)
22:23:25.111 STDOUT terraform:       + ingress                = (known after apply)
22:23:25.111 STDOUT terraform:       + name                   = "dev-apps-cluster-cluster-sg"
22:23:25.111 STDOUT terraform:       + name_prefix            = (known after apply)
22:23:25.111 STDOUT terraform:       + owner_id               = (known after apply)
22:23:25.111 STDOUT terraform:       + region                 = "eu-west-1"
22:23:25.111 STDOUT terraform:       + revoke_rules_on_delete = false
22:23:25.111 STDOUT terraform:       + tags                   = {
22:23:25.111 STDOUT terraform:           + "Cluster"     = "apps-cluster"
22:23:25.111 STDOUT terraform:           + "Environment" = "dev"
22:23:25.111 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.111 STDOUT terraform:           + "Name"        = "dev-apps-cluster-cluster-sg"
22:23:25.111 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.111 STDOUT terraform:           + "Purpose"     = "application-workloads"
22:23:25.111 STDOUT terraform:         }
22:23:25.111 STDOUT terraform:       + tags_all               = {
22:23:25.111 STDOUT terraform:           + "Cluster"     = "apps-cluster"
22:23:25.111 STDOUT terraform:           + "Environment" = "dev"
22:23:25.111 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.111 STDOUT terraform:           + "Name"        = "dev-apps-cluster-cluster-sg"
22:23:25.111 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.111 STDOUT terraform:           + "Purpose"     = "application-workloads"
22:23:25.111 STDOUT terraform:         }
22:23:25.111 STDOUT terraform:       + vpc_id                 = (known after apply)
22:23:25.111 STDOUT terraform:     }
22:23:25.111 STDOUT terraform:   # module.eks_apps.aws_security_group.pods will be created
22:23:25.111 STDOUT terraform:   + resource "aws_security_group" "pods" {
22:23:25.111 STDOUT terraform:       + arn                    = (known after apply)
22:23:25.111 STDOUT terraform:       + description            = "Security group for Fargate pods"
22:23:25.111 STDOUT terraform:       + egress                 = [
22:23:25.111 STDOUT terraform:           + {
22:23:25.111 STDOUT terraform:               + cidr_blocks      = [
22:23:25.111 STDOUT terraform:                   + "0.0.0.0/0",
22:23:25.111 STDOUT terraform:                 ]
22:23:25.111 STDOUT terraform:               + description      = "Allow all outbound traffic"
22:23:25.111 STDOUT terraform:               + from_port        = 0
22:23:25.111 STDOUT terraform:               + ipv6_cidr_blocks = []
22:23:25.111 STDOUT terraform:               + prefix_list_ids  = []
22:23:25.111 STDOUT terraform:               + protocol         = "-1"
22:23:25.111 STDOUT terraform:               + security_groups  = []
22:23:25.111 STDOUT terraform:               + self             = false
22:23:25.111 STDOUT terraform:               + to_port          = 0
22:23:25.111 STDOUT terraform:             },
22:23:25.111 STDOUT terraform:         ]
22:23:25.111 STDOUT terraform:       + id                     = (known after apply)
22:23:25.111 STDOUT terraform:       + ingress                = (known after apply)
22:23:25.111 STDOUT terraform:       + name                   = "dev-apps-cluster-pods-sg"
22:23:25.111 STDOUT terraform:       + name_prefix            = (known after apply)
22:23:25.111 STDOUT terraform:       + owner_id               = (known after apply)
22:23:25.111 STDOUT terraform:       + region                 = "eu-west-1"
22:23:25.111 STDOUT terraform:       + revoke_rules_on_delete = false
22:23:25.111 STDOUT terraform:       + tags                   = {
22:23:25.111 STDOUT terraform:           + "Cluster"     = "apps-cluster"
22:23:25.111 STDOUT terraform:           + "Environment" = "dev"
22:23:25.111 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.111 STDOUT terraform:           + "Name"        = "dev-apps-cluster-pods-sg"
22:23:25.111 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.111 STDOUT terraform:           + "Purpose"     = "application-workloads"
22:23:25.111 STDOUT terraform:         }
22:23:25.111 STDOUT terraform:       + tags_all               = {
22:23:25.111 STDOUT terraform:           + "Cluster"     = "apps-cluster"
22:23:25.111 STDOUT terraform:           + "Environment" = "dev"
22:23:25.111 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.111 STDOUT terraform:           + "Name"        = "dev-apps-cluster-pods-sg"
22:23:25.111 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.111 STDOUT terraform:           + "Purpose"     = "application-workloads"
22:23:25.111 STDOUT terraform:         }
22:23:25.111 STDOUT terraform:       + vpc_id                 = (known after apply)
22:23:25.111 STDOUT terraform:     }
22:23:25.111 STDOUT terraform:   # module.eks_apps.aws_security_group_rule.alb_to_pods["enabled"] will be created
22:23:25.111 STDOUT terraform:   + resource "aws_security_group_rule" "alb_to_pods" {
22:23:25.111 STDOUT terraform:       + description              = "Allow traffic from ALB"
22:23:25.111 STDOUT terraform:       + from_port                = 0
22:23:25.111 STDOUT terraform:       + id                       = (known after apply)
22:23:25.111 STDOUT terraform:       + protocol                 = "tcp"
22:23:25.111 STDOUT terraform:       + region                   = "eu-west-1"
22:23:25.112 STDOUT terraform:       + security_group_id        = (known after apply)
22:23:25.112 STDOUT terraform:       + security_group_rule_id   = (known after apply)
22:23:25.112 STDOUT terraform:       + self                     = false
22:23:25.112 STDOUT terraform:       + source_security_group_id = (known after apply)
22:23:25.112 STDOUT terraform:       + to_port                  = 65535
22:23:25.112 STDOUT terraform:       + type                     = "ingress"
22:23:25.112 STDOUT terraform:     }
22:23:25.112 STDOUT terraform:   # module.eks_mgmt.data.tls_certificate.cluster will be read during apply
22:23:25.112 STDOUT terraform:   # (config refers to values not yet known)
22:23:25.112 STDOUT terraform:  <= data "tls_certificate" "cluster" {
22:23:25.112 STDOUT terraform:       + certificates = (known after apply)
22:23:25.112 STDOUT terraform:       + id           = (known after apply)
22:23:25.112 STDOUT terraform:       + url          = (known after apply)
22:23:25.112 STDOUT terraform:     }
22:23:25.112 STDOUT terraform:   # module.eks_mgmt.aws_eks_cluster.main will be created
22:23:25.112 STDOUT terraform:   + resource "aws_eks_cluster" "main" {
22:23:25.112 STDOUT terraform:       + arn                           = (known after apply)
22:23:25.112 STDOUT terraform:       + bootstrap_self_managed_addons = true
22:23:25.112 STDOUT terraform:       + certificate_authority         = (known after apply)
22:23:25.112 STDOUT terraform:       + cluster_id                    = (known after apply)
22:23:25.112 STDOUT terraform:       + created_at                    = (known after apply)
22:23:25.112 STDOUT terraform:       + deletion_protection           = (known after apply)
22:23:25.112 STDOUT terraform:       + endpoint                      = (known after apply)
22:23:25.112 STDOUT terraform:       + id                            = (known after apply)
22:23:25.112 STDOUT terraform:       + identity                      = (known after apply)
22:23:25.112 STDOUT terraform:       + name                          = "dev-mgmt-cluster"
22:23:25.112 STDOUT terraform:       + platform_version              = (known after apply)
22:23:25.112 STDOUT terraform:       + region                        = "eu-west-1"
22:23:25.112 STDOUT terraform:       + role_arn                      = (known after apply)
22:23:25.112 STDOUT terraform:       + status                        = (known after apply)
22:23:25.112 STDOUT terraform:       + tags                          = {
22:23:25.112 STDOUT terraform:           + "Cluster"     = "mgmt-cluster"
22:23:25.112 STDOUT terraform:           + "Environment" = "dev"
22:23:25.112 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.112 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.112 STDOUT terraform:           + "Purpose"     = "argocd-management"
22:23:25.112 STDOUT terraform:         }
22:23:25.112 STDOUT terraform:       + tags_all                      = {
22:23:25.112 STDOUT terraform:           + "Cluster"     = "mgmt-cluster"
22:23:25.112 STDOUT terraform:           + "Environment" = "dev"
22:23:25.112 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.112 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.112 STDOUT terraform:           + "Purpose"     = "argocd-management"
22:23:25.112 STDOUT terraform:         }
22:23:25.112 STDOUT terraform:       + version                       = "1.34"
22:23:25.112 STDOUT terraform:       + access_config (known after apply)
22:23:25.112 STDOUT terraform:       + compute_config (known after apply)
22:23:25.112 STDOUT terraform:       + control_plane_scaling_config (known after apply)
22:23:25.112 STDOUT terraform:       + kubernetes_network_config (known after apply)
22:23:25.112 STDOUT terraform:       + storage_config (known after apply)
22:23:25.112 STDOUT terraform:       + upgrade_policy (known after apply)
22:23:25.112 STDOUT terraform:       + vpc_config {
22:23:25.112 STDOUT terraform:           + cluster_security_group_id = (known after apply)
22:23:25.112 STDOUT terraform:           + endpoint_private_access   = true
22:23:25.112 STDOUT terraform:           + endpoint_public_access    = true
22:23:25.112 STDOUT terraform:           + public_access_cidrs       = (known after apply)
22:23:25.112 STDOUT terraform:           + security_group_ids        = (known after apply)
22:23:25.112 STDOUT terraform:           + subnet_ids                = (known after apply)
22:23:25.112 STDOUT terraform:           + vpc_id                    = (known after apply)
22:23:25.112 STDOUT terraform:         }
22:23:25.112 STDOUT terraform:     }
22:23:25.112 STDOUT terraform:   # module.eks_mgmt.aws_eks_fargate_profile.app_namespaces["argocd"] will be created
22:23:25.112 STDOUT terraform:   + resource "aws_eks_fargate_profile" "app_namespaces" {
22:23:25.112 STDOUT terraform:       + arn                    = (known after apply)
22:23:25.112 STDOUT terraform:       + cluster_name           = "dev-mgmt-cluster"
22:23:25.112 STDOUT terraform:       + fargate_profile_name   = "dev-mgmt-cluster-argocd"
22:23:25.112 STDOUT terraform:       + id                     = (known after apply)
22:23:25.112 STDOUT terraform:       + pod_execution_role_arn = (known after apply)
22:23:25.112 STDOUT terraform:       + region                 = "eu-west-1"
22:23:25.112 STDOUT terraform:       + status                 = (known after apply)
22:23:25.113 STDOUT terraform:       + subnet_ids             = (known after apply)
22:23:25.113 STDOUT terraform:       + tags                   = {
22:23:25.113 STDOUT terraform:           + "Cluster"     = "mgmt-cluster"
22:23:25.113 STDOUT terraform:           + "Environment" = "dev"
22:23:25.113 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.113 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.113 STDOUT terraform:           + "Purpose"     = "argocd-management"
22:23:25.113 STDOUT terraform:         }
22:23:25.113 STDOUT terraform:       + tags_all               = {
22:23:25.113 STDOUT terraform:           + "Cluster"     = "mgmt-cluster"
22:23:25.113 STDOUT terraform:           + "Environment" = "dev"
22:23:25.113 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.113 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.113 STDOUT terraform:           + "Purpose"     = "argocd-management"
22:23:25.113 STDOUT terraform:         }
22:23:25.113 STDOUT terraform:       + selector {
22:23:25.113 STDOUT terraform:           + namespace = "argocd"
22:23:25.113 STDOUT terraform:         }
22:23:25.113 STDOUT terraform:     }
22:23:25.113 STDOUT terraform:   # module.eks_mgmt.aws_eks_fargate_profile.app_namespaces["default"] will be created
22:23:25.113 STDOUT terraform:   + resource "aws_eks_fargate_profile" "app_namespaces" {
22:23:25.113 STDOUT terraform:       + arn                    = (known after apply)
22:23:25.113 STDOUT terraform:       + cluster_name           = "dev-mgmt-cluster"
22:23:25.113 STDOUT terraform:       + fargate_profile_name   = "dev-mgmt-cluster-default"
22:23:25.113 STDOUT terraform:       + id                     = (known after apply)
22:23:25.113 STDOUT terraform:       + pod_execution_role_arn = (known after apply)
22:23:25.113 STDOUT terraform:       + region                 = "eu-west-1"
22:23:25.113 STDOUT terraform:       + status                 = (known after apply)
22:23:25.113 STDOUT terraform:       + subnet_ids             = (known after apply)
22:23:25.113 STDOUT terraform:       + tags                   = {
22:23:25.113 STDOUT terraform:           + "Cluster"     = "mgmt-cluster"
22:23:25.113 STDOUT terraform:           + "Environment" = "dev"
22:23:25.113 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.113 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.113 STDOUT terraform:           + "Purpose"     = "argocd-management"
22:23:25.113 STDOUT terraform:         }
22:23:25.113 STDOUT terraform:       + tags_all               = {
22:23:25.113 STDOUT terraform:           + "Cluster"     = "mgmt-cluster"
22:23:25.113 STDOUT terraform:           + "Environment" = "dev"
22:23:25.113 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.113 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.113 STDOUT terraform:           + "Purpose"     = "argocd-management"
22:23:25.113 STDOUT terraform:         }
22:23:25.113 STDOUT terraform:       + selector {
22:23:25.113 STDOUT terraform:           + namespace = "default"
22:23:25.113 STDOUT terraform:         }
22:23:25.113 STDOUT terraform:     }
22:23:25.113 STDOUT terraform:   # module.eks_mgmt.aws_eks_fargate_profile.kube_system will be created
22:23:25.113 STDOUT terraform:   + resource "aws_eks_fargate_profile" "kube_system" {
22:23:25.113 STDOUT terraform:       + arn                    = (known after apply)
22:23:25.113 STDOUT terraform:       + cluster_name           = "dev-mgmt-cluster"
22:23:25.113 STDOUT terraform:       + fargate_profile_name   = "dev-mgmt-cluster-kube-system"
22:23:25.113 STDOUT terraform:       + id                     = (known after apply)
22:23:25.113 STDOUT terraform:       + pod_execution_role_arn = (known after apply)
22:23:25.113 STDOUT terraform:       + region                 = "eu-west-1"
22:23:25.113 STDOUT terraform:       + status                 = (known after apply)
22:23:25.113 STDOUT terraform:       + subnet_ids             = (known after apply)
22:23:25.113 STDOUT terraform:       + tags                   = {
22:23:25.113 STDOUT terraform:           + "Cluster"     = "mgmt-cluster"
22:23:25.113 STDOUT terraform:           + "Environment" = "dev"
22:23:25.113 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.113 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.113 STDOUT terraform:           + "Purpose"     = "argocd-management"
22:23:25.113 STDOUT terraform:         }
22:23:25.113 STDOUT terraform:       + tags_all               = {
22:23:25.113 STDOUT terraform:           + "Cluster"     = "mgmt-cluster"
22:23:25.113 STDOUT terraform:           + "Environment" = "dev"
22:23:25.113 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.113 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.113 STDOUT terraform:           + "Purpose"     = "argocd-management"
22:23:25.113 STDOUT terraform:         }
22:23:25.113 STDOUT terraform:       + selector {
22:23:25.113 STDOUT terraform:           + namespace = "kube-system"
22:23:25.113 STDOUT terraform:         }
22:23:25.113 STDOUT terraform:     }
22:23:25.113 STDOUT terraform:   # module.eks_mgmt.aws_iam_openid_connect_provider.cluster will be created
22:23:25.113 STDOUT terraform:   + resource "aws_iam_openid_connect_provider" "cluster" {
22:23:25.113 STDOUT terraform:       + arn             = (known after apply)
22:23:25.114 STDOUT terraform:       + client_id_list  = [
22:23:25.114 STDOUT terraform:           + "sts.amazonaws.com",
22:23:25.114 STDOUT terraform:         ]
22:23:25.114 STDOUT terraform:       + id              = (known after apply)
22:23:25.114 STDOUT terraform:       + tags            = {
22:23:25.114 STDOUT terraform:           + "Cluster"     = "mgmt-cluster"
22:23:25.114 STDOUT terraform:           + "Environment" = "dev"
22:23:25.114 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.114 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.114 STDOUT terraform:           + "Purpose"     = "argocd-management"
22:23:25.114 STDOUT terraform:         }
22:23:25.114 STDOUT terraform:       + tags_all        = {
22:23:25.114 STDOUT terraform:           + "Cluster"     = "mgmt-cluster"
22:23:25.114 STDOUT terraform:           + "Environment" = "dev"
22:23:25.114 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.114 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.114 STDOUT terraform:           + "Purpose"     = "argocd-management"
22:23:25.114 STDOUT terraform:         }
22:23:25.114 STDOUT terraform:       + thumbprint_list = (known after apply)
22:23:25.114 STDOUT terraform:       + url             = (known after apply)
22:23:25.114 STDOUT terraform:     }
22:23:25.114 STDOUT terraform:   # module.eks_mgmt.aws_iam_policy.aws_load_balancer_controller[0] will be created
22:23:25.114 STDOUT terraform:   + resource "aws_iam_policy" "aws_load_balancer_controller" {
22:23:25.114 STDOUT terraform:       + arn              = (known after apply)
22:23:25.114 STDOUT terraform:       + attachment_count = (known after apply)
22:23:25.114 STDOUT terraform:       + description      = "IAM policy for AWS Load Balancer Controller"
22:23:25.114 STDOUT terraform:       + id               = (known after apply)
22:23:25.114 STDOUT terraform:       + name             = "dev-mgmt-cluster-aws-lb-controller-policy"
22:23:25.114 STDOUT terraform:       + name_prefix      = (known after apply)
22:23:25.114 STDOUT terraform:       + path             = "/"
22:23:25.114 STDOUT terraform:       + policy           = jsonencode(
22:23:25.114 STDOUT terraform:             {
22:23:25.114 STDOUT terraform:               + Statement = [
22:23:25.114 STDOUT terraform:                   + {
22:23:25.114 STDOUT terraform:                       + Action    = [
22:23:25.114 STDOUT terraform:                           + "iam:CreateServiceLinkedRole",
22:23:25.114 STDOUT terraform:                         ]
22:23:25.114 STDOUT terraform:                       + Condition = {
22:23:25.114 STDOUT terraform:                           + StringEquals = {
22:23:25.114 STDOUT terraform:                               + "iam:AWSServiceName" = "elasticloadbalancing.amazonaws.com"
22:23:25.114 STDOUT terraform:                             }
22:23:25.114 STDOUT terraform:                         }
22:23:25.114 STDOUT terraform:                       + Effect    = "Allow"
22:23:25.114 STDOUT terraform:                       + Resource  = "*"
22:23:25.114 STDOUT terraform:                     },
22:23:25.114 STDOUT terraform:                   + {
22:23:25.114 STDOUT terraform:                       + Action   = [
22:23:25.114 STDOUT terraform:                           + "ec2:DescribeAccountAttributes",
22:23:25.115 STDOUT terraform:                           + "ec2:DescribeAddresses",
22:23:25.115 STDOUT terraform:                           + "ec2:DescribeAvailabilityZones",
22:23:25.115 STDOUT terraform:                           + "ec2:DescribeInternetGateways",
22:23:25.115 STDOUT terraform:                           + "ec2:DescribeVpcs",
22:23:25.115 STDOUT terraform:                           + "ec2:DescribeVpcPeeringConnections",
22:23:25.115 STDOUT terraform:                           + "ec2:DescribeSubnets",
22:23:25.115 STDOUT terraform:                           + "ec2:DescribeSecurityGroups",
22:23:25.115 STDOUT terraform:                           + "ec2:DescribeInstances",
22:23:25.115 STDOUT terraform:                           + "ec2:DescribeNetworkInterfaces",
22:23:25.115 STDOUT terraform:                           + "ec2:DescribeTags",
22:23:25.115 STDOUT terraform:                           + "ec2:GetCoipPoolUsage",
22:23:25.115 STDOUT terraform:                           + "ec2:DescribeCoipPools",
22:23:25.115 STDOUT terraform:                           + "elasticloadbalancing:DescribeLoadBalancers",
22:23:25.115 STDOUT terraform:                           + "elasticloadbalancing:DescribeLoadBalancerAttributes",
22:23:25.115 STDOUT terraform:                           + "elasticloadbalancing:DescribeListeners",
22:23:25.115 STDOUT terraform:                           + "elasticloadbalancing:DescribeListenerCertificates",
22:23:25.115 STDOUT terraform:                           + "elasticloadbalancing:DescribeSSLPolicies",
22:23:25.115 STDOUT terraform:                           + "elasticloadbalancing:DescribeRules",
22:23:25.115 STDOUT terraform:                           + "elasticloadbalancing:DescribeTargetGroups",
22:23:25.115 STDOUT terraform:                           + "elasticloadbalancing:DescribeTargetGroupAttributes",
22:23:25.115 STDOUT terraform:                           + "elasticloadbalancing:DescribeTargetHealth",
22:23:25.115 STDOUT terraform:                           + "elasticloadbalancing:DescribeTags",
22:23:25.115 STDOUT terraform:                         ]
22:23:25.115 STDOUT terraform:                       + Effect   = "Allow"
22:23:25.115 STDOUT terraform:                       + Resource = "*"
22:23:25.115 STDOUT terraform:                     },
22:23:25.115 STDOUT terraform:                   + {
22:23:25.115 STDOUT terraform:                       + Action   = [
22:23:25.115 STDOUT terraform:                           + "cognito-idp:DescribeUserPoolClient",
22:23:25.115 STDOUT terraform:                           + "acm:ListCertificates",
22:23:25.115 STDOUT terraform:                           + "acm:DescribeCertificate",
22:23:25.115 STDOUT terraform:                           + "iam:ListServerCertificates",
22:23:25.115 STDOUT terraform:                           + "iam:GetServerCertificate",
22:23:25.116 STDOUT terraform:                           + "waf-regional:GetWebACL",
22:23:25.116 STDOUT terraform:                           + "waf-regional:GetWebACLForResource",
22:23:25.116 STDOUT terraform:                           + "waf-regional:AssociateWebACL",
22:23:25.116 STDOUT terraform:                           + "waf-regional:DisassociateWebACL",
22:23:25.116 STDOUT terraform:                           + "wafv2:GetWebACL",
22:23:25.116 STDOUT terraform:                           + "wafv2:GetWebACLForResource",
22:23:25.116 STDOUT terraform:                           + "wafv2:AssociateWebACL",
22:23:25.116 STDOUT terraform:                           + "wafv2:DisassociateWebACL",
22:23:25.116 STDOUT terraform:                           + "shield:GetSubscriptionState",
22:23:25.116 STDOUT terraform:                           + "shield:DescribeProtection",
22:23:25.116 STDOUT terraform:                           + "shield:CreateProtection",
22:23:25.116 STDOUT terraform:                           + "shield:DeleteProtection",
22:23:25.116 STDOUT terraform:                         ]
22:23:25.116 STDOUT terraform:                       + Effect   = "Allow"
22:23:25.116 STDOUT terraform:                       + Resource = "*"
22:23:25.116 STDOUT terraform:                     },
22:23:25.116 STDOUT terraform:                   + {
22:23:25.116 STDOUT terraform:                       + Action   = [
22:23:25.116 STDOUT terraform:                           + "ec2:AuthorizeSecurityGroupIngress",
22:23:25.116 STDOUT terraform:                           + "ec2:RevokeSecurityGroupIngress",
22:23:25.116 STDOUT terraform:                         ]
22:23:25.116 STDOUT terraform:                       + Effect   = "Allow"
22:23:25.116 STDOUT terraform:                       + Resource = "*"
22:23:25.116 STDOUT terraform:                     },
22:23:25.116 STDOUT terraform:                   + {
22:23:25.116 STDOUT terraform:                       + Action   = [
22:23:25.116 STDOUT terraform:                           + "ec2:CreateSecurityGroup",
22:23:25.116 STDOUT terraform:                         ]
22:23:25.116 STDOUT terraform:                       + Effect   = "Allow"
22:23:25.116 STDOUT terraform:                       + Resource = "*"
22:23:25.116 STDOUT terraform:                     },
22:23:25.116 STDOUT terraform:                   + {
22:23:25.116 STDOUT terraform:                       + Action    = [
22:23:25.116 STDOUT terraform:                           + "ec2:CreateTags",
22:23:25.116 STDOUT terraform:                         ]
22:23:25.116 STDOUT terraform:                       + Condition = {
22:23:25.116 STDOUT terraform:                           + Null         = {
22:23:25.116 STDOUT terraform:                               + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
22:23:25.116 STDOUT terraform:                             }
22:23:25.116 STDOUT terraform:                           + StringEquals = {
22:23:25.117 STDOUT terraform:                               + "ec2:CreateAction" = "CreateSecurityGroup"
22:23:25.117 STDOUT terraform:                             }
22:23:25.117 STDOUT terraform:                         }
22:23:25.117 STDOUT terraform:                       + Effect    = "Allow"
22:23:25.117 STDOUT terraform:                       + Resource  = "arn:aws:ec2:*:*:security-group/*"
22:23:25.117 STDOUT terraform:                     },
22:23:25.117 STDOUT terraform:                   + {
22:23:25.117 STDOUT terraform:                       + Action    = [
22:23:25.117 STDOUT terraform:                           + "ec2:CreateTags",
22:23:25.117 STDOUT terraform:                           + "ec2:DeleteTags",
22:23:25.117 STDOUT terraform:                         ]
22:23:25.117 STDOUT terraform:                       + Condition = {
22:23:25.117 STDOUT terraform:                           + Null = {
22:23:25.117 STDOUT terraform:                               + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
22:23:25.117 STDOUT terraform:                               + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
22:23:25.117 STDOUT terraform:                             }
22:23:25.117 STDOUT terraform:                         }
22:23:25.117 STDOUT terraform:                       + Effect    = "Allow"
22:23:25.117 STDOUT terraform:                       + Resource  = "arn:aws:ec2:*:*:security-group/*"
22:23:25.117 STDOUT terraform:                     },
22:23:25.117 STDOUT terraform:                   + {
22:23:25.117 STDOUT terraform:                       + Action    = [
22:23:25.117 STDOUT terraform:                           + "ec2:AuthorizeSecurityGroupIngress",
22:23:25.117 STDOUT terraform:                           + "ec2:RevokeSecurityGroupIngress",
22:23:25.117 STDOUT terraform:                           + "ec2:DeleteSecurityGroup",
22:23:25.117 STDOUT terraform:                         ]
22:23:25.117 STDOUT terraform:                       + Condition = {
22:23:25.117 STDOUT terraform:                           + Null = {
22:23:25.117 STDOUT terraform:                               + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
22:23:25.117 STDOUT terraform:                             }
22:23:25.117 STDOUT terraform:                         }
22:23:25.117 STDOUT terraform:                       + Effect    = "Allow"
22:23:25.117 STDOUT terraform:                       + Resource  = "*"
22:23:25.117 STDOUT terraform:                     },
22:23:25.117 STDOUT terraform:                   + {
22:23:25.117 STDOUT terraform:                       + Action    = [
22:23:25.117 STDOUT terraform:                           + "elasticloadbalancing:CreateLoadBalancer",
22:23:25.117 STDOUT terraform:                           + "elasticloadbalancing:CreateTargetGroup",
22:23:25.117 STDOUT terraform:                         ]
22:23:25.117 STDOUT terraform:                       + Condition = {
22:23:25.118 STDOUT terraform:                           + Null = {
22:23:25.118 STDOUT terraform:                               + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
22:23:25.118 STDOUT terraform:                             }
22:23:25.118 STDOUT terraform:                         }
22:23:25.118 STDOUT terraform:                       + Effect    = "Allow"
22:23:25.118 STDOUT terraform:                       + Resource  = "*"
22:23:25.118 STDOUT terraform:                     },
22:23:25.118 STDOUT terraform:                   + {
22:23:25.118 STDOUT terraform:                       + Action   = [
22:23:25.118 STDOUT terraform:                           + "elasticloadbalancing:CreateListener",
22:23:25.118 STDOUT terraform:                           + "elasticloadbalancing:DeleteListener",
22:23:25.118 STDOUT terraform:                           + "elasticloadbalancing:CreateRule",
22:23:25.118 STDOUT terraform:                           + "elasticloadbalancing:DeleteRule",
22:23:25.118 STDOUT terraform:                         ]
22:23:25.118 STDOUT terraform:                       + Effect   = "Allow"
22:23:25.118 STDOUT terraform:                       + Resource = "*"
22:23:25.118 STDOUT terraform:                     },
22:23:25.118 STDOUT terraform:                   + {
22:23:25.118 STDOUT terraform:                       + Action    = [
22:23:25.118 STDOUT terraform:                           + "elasticloadbalancing:AddTags",
22:23:25.118 STDOUT terraform:                           + "elasticloadbalancing:RemoveTags",
22:23:25.118 STDOUT terraform:                         ]
22:23:25.118 STDOUT terraform:                       + Condition = {
22:23:25.118 STDOUT terraform:                           + Null = {
22:23:25.118 STDOUT terraform:                               + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
22:23:25.118 STDOUT terraform:                               + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
22:23:25.118 STDOUT terraform:                             }
22:23:25.118 STDOUT terraform:                         }
22:23:25.118 STDOUT terraform:                       + Effect    = "Allow"
22:23:25.118 STDOUT terraform:                       + Resource  = [
22:23:25.118 STDOUT terraform:                           + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
22:23:25.118 STDOUT terraform:                           + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
22:23:25.118 STDOUT terraform:                           + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
22:23:25.118 STDOUT terraform:                         ]
22:23:25.118 STDOUT terraform:                     },
22:23:25.118 STDOUT terraform:                   + {
22:23:25.118 STDOUT terraform:                       + Action   = [
22:23:25.118 STDOUT terraform:                           + "elasticloadbalancing:AddTags",
22:23:25.119 STDOUT terraform:                           + "elasticloadbalancing:RemoveTags",
22:23:25.119 STDOUT terraform:                         ]
22:23:25.119 STDOUT terraform:                       + Effect   = "Allow"
22:23:25.119 STDOUT terraform:                       + Resource = [
22:23:25.119 STDOUT terraform:                           + "arn:aws:elasticloadbalancing:*:*:listener/net/*/*/*",
22:23:25.119 STDOUT terraform:                           + "arn:aws:elasticloadbalancing:*:*:listener/app/*/*/*",
22:23:25.119 STDOUT terraform:                           + "arn:aws:elasticloadbalancing:*:*:listener-rule/net/*/*/*",
22:23:25.119 STDOUT terraform:                           + "arn:aws:elasticloadbalancing:*:*:listener-rule/app/*/*/*",
22:23:25.119 STDOUT terraform:                         ]
22:23:25.119 STDOUT terraform:                     },
22:23:25.119 STDOUT terraform:                   + {
22:23:25.119 STDOUT terraform:                       + Action    = [
22:23:25.119 STDOUT terraform:                           + "elasticloadbalancing:ModifyLoadBalancerAttributes",
22:23:25.119 STDOUT terraform:                           + "elasticloadbalancing:SetIpAddressType",
22:23:25.119 STDOUT terraform:                           + "elasticloadbalancing:SetSecurityGroups",
22:23:25.119 STDOUT terraform:                           + "elasticloadbalancing:SetSubnets",
22:23:25.119 STDOUT terraform:                           + "elasticloadbalancing:DeleteLoadBalancer",
22:23:25.119 STDOUT terraform:                           + "elasticloadbalancing:ModifyTargetGroup",
22:23:25.119 STDOUT terraform:                           + "elasticloadbalancing:ModifyTargetGroupAttributes",
22:23:25.119 STDOUT terraform:                           + "elasticloadbalancing:DeleteTargetGroup",
22:23:25.119 STDOUT terraform:                         ]
22:23:25.119 STDOUT terraform:                       + Condition = {
22:23:25.119 STDOUT terraform:                           + Null = {
22:23:25.119 STDOUT terraform:                               + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
22:23:25.119 STDOUT terraform:                             }
22:23:25.119 STDOUT terraform:                         }
22:23:25.119 STDOUT terraform:                       + Effect    = "Allow"
22:23:25.119 STDOUT terraform:                       + Resource  = "*"
22:23:25.119 STDOUT terraform:                     },
22:23:25.119 STDOUT terraform:                   + {
22:23:25.119 STDOUT terraform:                       + Action   = [
22:23:25.119 STDOUT terraform:                           + "elasticloadbalancing:RegisterTargets",
22:23:25.119 STDOUT terraform:                           + "elasticloadbalancing:DeregisterTargets",
22:23:25.119 STDOUT terraform:                         ]
22:23:25.120 STDOUT terraform:                       + Effect   = "Allow"
22:23:25.120 STDOUT terraform:                       + Resource = "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*"
22:23:25.120 STDOUT terraform:                     },
22:23:25.120 STDOUT terraform:                   + {
22:23:25.120 STDOUT terraform:                       + Action   = [
22:23:25.120 STDOUT terraform:                           + "elasticloadbalancing:SetWebAcl",
22:23:25.120 STDOUT terraform:                           + "elasticloadbalancing:ModifyListener",
22:23:25.120 STDOUT terraform:                           + "elasticloadbalancing:AddListenerCertificates",
22:23:25.120 STDOUT terraform:                           + "elasticloadbalancing:RemoveListenerCertificates",
22:23:25.120 STDOUT terraform:                           + "elasticloadbalancing:ModifyRule",
22:23:25.120 STDOUT terraform:                         ]
22:23:25.120 STDOUT terraform:                       + Effect   = "Allow"
22:23:25.120 STDOUT terraform:                       + Resource = "*"
22:23:25.120 STDOUT terraform:                     },
22:23:25.120 STDOUT terraform:                 ]
22:23:25.120 STDOUT terraform:               + Version   = "2012-10-17"
22:23:25.120 STDOUT terraform:             }
22:23:25.120 STDOUT terraform:         )
22:23:25.120 STDOUT terraform:       + policy_id        = (known after apply)
22:23:25.120 STDOUT terraform:       + tags             = {
22:23:25.120 STDOUT terraform:           + "Cluster"     = "mgmt-cluster"
22:23:25.120 STDOUT terraform:           + "Environment" = "dev"
22:23:25.120 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.120 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.120 STDOUT terraform:           + "Purpose"     = "argocd-management"
22:23:25.120 STDOUT terraform:         }
22:23:25.120 STDOUT terraform:       + tags_all         = {
22:23:25.120 STDOUT terraform:           + "Cluster"     = "mgmt-cluster"
22:23:25.120 STDOUT terraform:           + "Environment" = "dev"
22:23:25.120 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.120 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.120 STDOUT terraform:           + "Purpose"     = "argocd-management"
22:23:25.120 STDOUT terraform:         }
22:23:25.120 STDOUT terraform:     }
22:23:25.120 STDOUT terraform:   # module.eks_mgmt.aws_iam_role.aws_load_balancer_controller[0] will be created
22:23:25.120 STDOUT terraform:   + resource "aws_iam_role" "aws_load_balancer_controller" {
22:23:25.120 STDOUT terraform:       + arn                   = (known after apply)
22:23:25.120 STDOUT terraform:       + assume_role_policy    = (known after apply)
22:23:25.120 STDOUT terraform:       + create_date           = (known after apply)
22:23:25.120 STDOUT terraform:       + force_detach_policies = false
22:23:25.120 STDOUT terraform:       + id                    = (known after apply)
22:23:25.120 STDOUT terraform:       + managed_policy_arns   = (known after apply)
22:23:25.120 STDOUT terraform:       + max_session_duration  = 3600
22:23:25.120 STDOUT terraform:       + name                  = "dev-mgmt-cluster-aws-lb-controller"
22:23:25.120 STDOUT terraform:       + name_prefix           = (known after apply)
22:23:25.120 STDOUT terraform:       + path                  = "/"
22:23:25.120 STDOUT terraform:       + tags                  = {
22:23:25.120 STDOUT terraform:           + "Cluster"     = "mgmt-cluster"
22:23:25.120 STDOUT terraform:           + "Environment" = "dev"
22:23:25.120 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.120 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.120 STDOUT terraform:           + "Purpose"     = "argocd-management"
22:23:25.120 STDOUT terraform:         }
22:23:25.120 STDOUT terraform:       + tags_all              = {
22:23:25.120 STDOUT terraform:           + "Cluster"     = "mgmt-cluster"
22:23:25.121 STDOUT terraform:           + "Environment" = "dev"
22:23:25.121 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.121 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.121 STDOUT terraform:           + "Purpose"     = "argocd-management"
22:23:25.121 STDOUT terraform:         }
22:23:25.121 STDOUT terraform:       + unique_id             = (known after apply)
22:23:25.121 STDOUT terraform:       + inline_policy (known after apply)
22:23:25.121 STDOUT terraform:     }
22:23:25.121 STDOUT terraform:   # module.eks_mgmt.aws_iam_role.cluster will be created
22:23:25.121 STDOUT terraform:   + resource "aws_iam_role" "cluster" {
22:23:25.121 STDOUT terraform:       + arn                   = (known after apply)
22:23:25.121 STDOUT terraform:       + assume_role_policy    = jsonencode(
22:23:25.121 STDOUT terraform:             {
22:23:25.121 STDOUT terraform:               + Statement = [
22:23:25.121 STDOUT terraform:                   + {
22:23:25.121 STDOUT terraform:                       + Action    = "sts:AssumeRole"
22:23:25.121 STDOUT terraform:                       + Effect    = "Allow"
22:23:25.121 STDOUT terraform:                       + Principal = {
22:23:25.121 STDOUT terraform:                           + Service = "eks.amazonaws.com"
22:23:25.121 STDOUT terraform:                         }
22:23:25.121 STDOUT terraform:                     },
22:23:25.121 STDOUT terraform:                 ]
22:23:25.121 STDOUT terraform:               + Version   = "2012-10-17"
22:23:25.121 STDOUT terraform:             }
22:23:25.121 STDOUT terraform:         )
22:23:25.121 STDOUT terraform:       + create_date           = (known after apply)
22:23:25.121 STDOUT terraform:       + force_detach_policies = false
22:23:25.121 STDOUT terraform:       + id                    = (known after apply)
22:23:25.121 STDOUT terraform:       + managed_policy_arns   = (known after apply)
22:23:25.121 STDOUT terraform:       + max_session_duration  = 3600
22:23:25.121 STDOUT terraform:       + name                  = "dev-mgmt-cluster-cluster-role"
22:23:25.121 STDOUT terraform:       + name_prefix           = (known after apply)
22:23:25.121 STDOUT terraform:       + path                  = "/"
22:23:25.121 STDOUT terraform:       + tags                  = {
22:23:25.121 STDOUT terraform:           + "Cluster"     = "mgmt-cluster"
22:23:25.121 STDOUT terraform:           + "Environment" = "dev"
22:23:25.121 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.121 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.121 STDOUT terraform:           + "Purpose"     = "argocd-management"
22:23:25.121 STDOUT terraform:         }
22:23:25.121 STDOUT terraform:       + tags_all              = {
22:23:25.121 STDOUT terraform:           + "Cluster"     = "mgmt-cluster"
22:23:25.121 STDOUT terraform:           + "Environment" = "dev"
22:23:25.121 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.121 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.121 STDOUT terraform:           + "Purpose"     = "argocd-management"
22:23:25.121 STDOUT terraform:         }
22:23:25.121 STDOUT terraform:       + unique_id             = (known after apply)
22:23:25.121 STDOUT terraform:       + inline_policy (known after apply)
22:23:25.121 STDOUT terraform:     }
22:23:25.121 STDOUT terraform:   # module.eks_mgmt.aws_iam_role.fargate will be created
22:23:25.121 STDOUT terraform:   + resource "aws_iam_role" "fargate" {
22:23:25.121 STDOUT terraform:       + arn                   = (known after apply)
22:23:25.121 STDOUT terraform:       + assume_role_policy    = jsonencode(
22:23:25.121 STDOUT terraform:             {
22:23:25.121 STDOUT terraform:               + Statement = [
22:23:25.121 STDOUT terraform:                   + {
22:23:25.121 STDOUT terraform:                       + Action    = "sts:AssumeRole"
22:23:25.121 STDOUT terraform:                       + Effect    = "Allow"
22:23:25.121 STDOUT terraform:                       + Principal = {
22:23:25.121 STDOUT terraform:                           + Service = "eks-fargate-pods.amazonaws.com"
22:23:25.121 STDOUT terraform:                         }
22:23:25.121 STDOUT terraform:                     },
22:23:25.121 STDOUT terraform:                 ]
22:23:25.121 STDOUT terraform:               + Version   = "2012-10-17"
22:23:25.121 STDOUT terraform:             }
22:23:25.121 STDOUT terraform:         )
22:23:25.121 STDOUT terraform:       + create_date           = (known after apply)
22:23:25.121 STDOUT terraform:       + force_detach_policies = false
22:23:25.121 STDOUT terraform:       + id                    = (known after apply)
22:23:25.121 STDOUT terraform:       + managed_policy_arns   = (known after apply)
22:23:25.121 STDOUT terraform:       + max_session_duration  = 3600
22:23:25.121 STDOUT terraform:       + name                  = "dev-mgmt-cluster-fargate-role"
22:23:25.121 STDOUT terraform:       + name_prefix           = (known after apply)
22:23:25.121 STDOUT terraform:       + path                  = "/"
22:23:25.121 STDOUT terraform:       + tags                  = {
22:23:25.121 STDOUT terraform:           + "Cluster"     = "mgmt-cluster"
22:23:25.122 STDOUT terraform:           + "Environment" = "dev"
22:23:25.122 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.122 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.122 STDOUT terraform:           + "Purpose"     = "argocd-management"
22:23:25.122 STDOUT terraform:         }
22:23:25.122 STDOUT terraform:       + tags_all              = {
22:23:25.122 STDOUT terraform:           + "Cluster"     = "mgmt-cluster"
22:23:25.122 STDOUT terraform:           + "Environment" = "dev"
22:23:25.122 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.122 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.122 STDOUT terraform:           + "Purpose"     = "argocd-management"
22:23:25.122 STDOUT terraform:         }
22:23:25.122 STDOUT terraform:       + unique_id             = (known after apply)
22:23:25.122 STDOUT terraform:       + inline_policy (known after apply)
22:23:25.122 STDOUT terraform:     }
22:23:25.122 STDOUT terraform:   # module.eks_mgmt.aws_iam_role_policy_attachment.aws_load_balancer_controller[0] will be created
22:23:25.122 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "aws_load_balancer_controller" {
22:23:25.122 STDOUT terraform:       + id         = (known after apply)
22:23:25.122 STDOUT terraform:       + policy_arn = (known after apply)
22:23:25.122 STDOUT terraform:       + role       = "dev-mgmt-cluster-aws-lb-controller"
22:23:25.122 STDOUT terraform:     }
22:23:25.122 STDOUT terraform:   # module.eks_mgmt.aws_iam_role_policy_attachment.cluster_policy will be created
22:23:25.122 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "cluster_policy" {
22:23:25.122 STDOUT terraform:       + id         = (known after apply)
22:23:25.122 STDOUT terraform:       + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
22:23:25.122 STDOUT terraform:       + role       = "dev-mgmt-cluster-cluster-role"
22:23:25.122 STDOUT terraform:     }
22:23:25.122 STDOUT terraform:   # module.eks_mgmt.aws_iam_role_policy_attachment.fargate_pod_execution will be created
22:23:25.122 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "fargate_pod_execution" {
22:23:25.122 STDOUT terraform:       + id         = (known after apply)
22:23:25.122 STDOUT terraform:       + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"
22:23:25.122 STDOUT terraform:       + role       = "dev-mgmt-cluster-fargate-role"
22:23:25.122 STDOUT terraform:     }
22:23:25.122 STDOUT terraform:   # module.eks_mgmt.aws_security_group.cluster will be created
22:23:25.122 STDOUT terraform:   + resource "aws_security_group" "cluster" {
22:23:25.122 STDOUT terraform:       + arn                    = (known after apply)
22:23:25.122 STDOUT terraform:       + description            = "Security group for EKS cluster control plane"
22:23:25.122 STDOUT terraform:       + egress                 = [
22:23:25.122 STDOUT terraform:           + {
22:23:25.122 STDOUT terraform:               + cidr_blocks      = [
22:23:25.122 STDOUT terraform:                   + "0.0.0.0/0",
22:23:25.122 STDOUT terraform:                 ]
22:23:25.122 STDOUT terraform:               + description      = "Allow all outbound traffic"
22:23:25.122 STDOUT terraform:               + from_port        = 0
22:23:25.122 STDOUT terraform:               + ipv6_cidr_blocks = []
22:23:25.122 STDOUT terraform:               + prefix_list_ids  = []
22:23:25.122 STDOUT terraform:               + protocol         = "-1"
22:23:25.122 STDOUT terraform:               + security_groups  = []
22:23:25.122 STDOUT terraform:               + self             = false
22:23:25.122 STDOUT terraform:               + to_port          = 0
22:23:25.122 STDOUT terraform:             },
22:23:25.122 STDOUT terraform:         ]
22:23:25.122 STDOUT terraform:       + id                     = (known after apply)
22:23:25.122 STDOUT terraform:       + ingress                = (known after apply)
22:23:25.122 STDOUT terraform:       + name                   = "dev-mgmt-cluster-cluster-sg"
22:23:25.122 STDOUT terraform:       + name_prefix            = (known after apply)
22:23:25.122 STDOUT terraform:       + owner_id               = (known after apply)
22:23:25.122 STDOUT terraform:       + region                 = "eu-west-1"
22:23:25.122 STDOUT terraform:       + revoke_rules_on_delete = false
22:23:25.122 STDOUT terraform:       + tags                   = {
22:23:25.122 STDOUT terraform:           + "Cluster"     = "mgmt-cluster"
22:23:25.122 STDOUT terraform:           + "Environment" = "dev"
22:23:25.122 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.122 STDOUT terraform:           + "Name"        = "dev-mgmt-cluster-cluster-sg"
22:23:25.122 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.122 STDOUT terraform:           + "Purpose"     = "argocd-management"
22:23:25.122 STDOUT terraform:         }
22:23:25.122 STDOUT terraform:       + tags_all               = {
22:23:25.122 STDOUT terraform:           + "Cluster"     = "mgmt-cluster"
22:23:25.122 STDOUT terraform:           + "Environment" = "dev"
22:23:25.122 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.122 STDOUT terraform:           + "Name"        = "dev-mgmt-cluster-cluster-sg"
22:23:25.123 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.123 STDOUT terraform:           + "Purpose"     = "argocd-management"
22:23:25.123 STDOUT terraform:         }
22:23:25.123 STDOUT terraform:       + vpc_id                 = (known after apply)
22:23:25.123 STDOUT terraform:     }
22:23:25.123 STDOUT terraform:   # module.eks_mgmt.aws_security_group.pods will be created
22:23:25.123 STDOUT terraform:   + resource "aws_security_group" "pods" {
22:23:25.123 STDOUT terraform:       + arn                    = (known after apply)
22:23:25.123 STDOUT terraform:       + description            = "Security group for Fargate pods"
22:23:25.123 STDOUT terraform:       + egress                 = [
22:23:25.123 STDOUT terraform:           + {
22:23:25.123 STDOUT terraform:               + cidr_blocks      = [
22:23:25.123 STDOUT terraform:                   + "0.0.0.0/0",
22:23:25.123 STDOUT terraform:                 ]
22:23:25.123 STDOUT terraform:               + description      = "Allow all outbound traffic"
22:23:25.123 STDOUT terraform:               + from_port        = 0
22:23:25.123 STDOUT terraform:               + ipv6_cidr_blocks = []
22:23:25.123 STDOUT terraform:               + prefix_list_ids  = []
22:23:25.123 STDOUT terraform:               + protocol         = "-1"
22:23:25.123 STDOUT terraform:               + security_groups  = []
22:23:25.123 STDOUT terraform:               + self             = false
22:23:25.123 STDOUT terraform:               + to_port          = 0
22:23:25.123 STDOUT terraform:             },
22:23:25.123 STDOUT terraform:         ]
22:23:25.123 STDOUT terraform:       + id                     = (known after apply)
22:23:25.123 STDOUT terraform:       + ingress                = (known after apply)
22:23:25.123 STDOUT terraform:       + name                   = "dev-mgmt-cluster-pods-sg"
22:23:25.123 STDOUT terraform:       + name_prefix            = (known after apply)
22:23:25.123 STDOUT terraform:       + owner_id               = (known after apply)
22:23:25.123 STDOUT terraform:       + region                 = "eu-west-1"
22:23:25.123 STDOUT terraform:       + revoke_rules_on_delete = false
22:23:25.123 STDOUT terraform:       + tags                   = {
22:23:25.123 STDOUT terraform:           + "Cluster"     = "mgmt-cluster"
22:23:25.123 STDOUT terraform:           + "Environment" = "dev"
22:23:25.123 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.123 STDOUT terraform:           + "Name"        = "dev-mgmt-cluster-pods-sg"
22:23:25.123 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.123 STDOUT terraform:           + "Purpose"     = "argocd-management"
22:23:25.123 STDOUT terraform:         }
22:23:25.123 STDOUT terraform:       + tags_all               = {
22:23:25.123 STDOUT terraform:           + "Cluster"     = "mgmt-cluster"
22:23:25.123 STDOUT terraform:           + "Environment" = "dev"
22:23:25.123 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.123 STDOUT terraform:           + "Name"        = "dev-mgmt-cluster-pods-sg"
22:23:25.123 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.123 STDOUT terraform:           + "Purpose"     = "argocd-management"
22:23:25.123 STDOUT terraform:         }
22:23:25.123 STDOUT terraform:       + vpc_id                 = (known after apply)
22:23:25.123 STDOUT terraform:     }
22:23:25.123 STDOUT terraform:   # module.eks_mgmt.aws_security_group_rule.alb_to_pods["enabled"] will be created
22:23:25.123 STDOUT terraform:   + resource "aws_security_group_rule" "alb_to_pods" {
22:23:25.123 STDOUT terraform:       + description              = "Allow traffic from ALB"
22:23:25.123 STDOUT terraform:       + from_port                = 0
22:23:25.123 STDOUT terraform:       + id                       = (known after apply)
22:23:25.123 STDOUT terraform:       + protocol                 = "tcp"
22:23:25.123 STDOUT terraform:       + region                   = "eu-west-1"
22:23:25.123 STDOUT terraform:       + security_group_id        = (known after apply)
22:23:25.123 STDOUT terraform:       + security_group_rule_id   = (known after apply)
22:23:25.123 STDOUT terraform:       + self                     = false
22:23:25.123 STDOUT terraform:       + source_security_group_id = (known after apply)
22:23:25.123 STDOUT terraform:       + to_port                  = 65535
22:23:25.123 STDOUT terraform:       + type                     = "ingress"
22:23:25.123 STDOUT terraform:     }
22:23:25.123 STDOUT terraform:   # module.vpc.aws_eip.nat will be created
22:23:25.123 STDOUT terraform:   + resource "aws_eip" "nat" {
22:23:25.123 STDOUT terraform:       + allocation_id        = (known after apply)
22:23:25.123 STDOUT terraform:       + arn                  = (known after apply)
22:23:25.123 STDOUT terraform:       + association_id       = (known after apply)
22:23:25.123 STDOUT terraform:       + carrier_ip           = (known after apply)
22:23:25.123 STDOUT terraform:       + customer_owned_ip    = (known after apply)
22:23:25.123 STDOUT terraform:       + domain               = "vpc"
22:23:25.123 STDOUT terraform:       + id                   = (known after apply)
22:23:25.123 STDOUT terraform:       + instance             = (known after apply)
22:23:25.123 STDOUT terraform:       + ipam_pool_id         = (known after apply)
22:23:25.124 STDOUT terraform:       + network_border_group = (known after apply)
22:23:25.124 STDOUT terraform:       + network_interface    = (known after apply)
22:23:25.124 STDOUT terraform:       + private_dns          = (known after apply)
22:23:25.124 STDOUT terraform:       + private_ip           = (known after apply)
22:23:25.124 STDOUT terraform:       + ptr_record           = (known after apply)
22:23:25.124 STDOUT terraform:       + public_dns           = (known after apply)
22:23:25.124 STDOUT terraform:       + public_ip            = (known after apply)
22:23:25.124 STDOUT terraform:       + public_ipv4_pool     = (known after apply)
22:23:25.124 STDOUT terraform:       + region               = "eu-west-1"
22:23:25.124 STDOUT terraform:       + tags                 = {
22:23:25.124 STDOUT terraform:           + "Environment" = "dev"
22:23:25.124 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.124 STDOUT terraform:           + "Name"        = "dev-shared-vpc-nat-eip"
22:23:25.124 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.124 STDOUT terraform:         }
22:23:25.124 STDOUT terraform:       + tags_all             = {
22:23:25.124 STDOUT terraform:           + "Environment" = "dev"
22:23:25.124 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.124 STDOUT terraform:           + "Name"        = "dev-shared-vpc-nat-eip"
22:23:25.124 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.124 STDOUT terraform:         }
22:23:25.124 STDOUT terraform:     }
22:23:25.124 STDOUT terraform:   # module.vpc.aws_internet_gateway.main will be created
22:23:25.124 STDOUT terraform:   + resource "aws_internet_gateway" "main" {
22:23:25.124 STDOUT terraform:       + arn      = (known after apply)
22:23:25.124 STDOUT terraform:       + id       = (known after apply)
22:23:25.124 STDOUT terraform:       + owner_id = (known after apply)
22:23:25.124 STDOUT terraform:       + region   = "eu-west-1"
22:23:25.124 STDOUT terraform:       + tags     = {
22:23:25.124 STDOUT terraform:           + "Environment" = "dev"
22:23:25.124 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.124 STDOUT terraform:           + "Name"        = "dev-shared-vpc-igw"
22:23:25.124 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.124 STDOUT terraform:         }
22:23:25.124 STDOUT terraform:       + tags_all = {
22:23:25.124 STDOUT terraform:           + "Environment" = "dev"
22:23:25.124 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.124 STDOUT terraform:           + "Name"        = "dev-shared-vpc-igw"
22:23:25.124 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.124 STDOUT terraform:         }
22:23:25.124 STDOUT terraform:       + vpc_id   = (known after apply)
22:23:25.124 STDOUT terraform:     }
22:23:25.124 STDOUT terraform:   # module.vpc.aws_lb.shared[0] will be created
22:23:25.124 STDOUT terraform:   + resource "aws_lb" "shared" {
22:23:25.124 STDOUT terraform:       + arn                                                          = (known after apply)
22:23:25.124 STDOUT terraform:       + arn_suffix                                                   = (known after apply)
22:23:25.124 STDOUT terraform:       + client_keep_alive                                            = 3600
22:23:25.124 STDOUT terraform:       + desync_mitigation_mode                                       = "defensive"
22:23:25.124 STDOUT terraform:       + dns_name                                                     = (known after apply)
22:23:25.124 STDOUT terraform:       + drop_invalid_header_fields                                   = false
22:23:25.124 STDOUT terraform:       + enable_deletion_protection                                   = false
22:23:25.124 STDOUT terraform:       + enable_http2                                                 = true
22:23:25.124 STDOUT terraform:       + enable_tls_version_and_cipher_suite_headers                  = false
22:23:25.124 STDOUT terraform:       + enable_waf_fail_open                                         = false
22:23:25.124 STDOUT terraform:       + enable_xff_client_port                                       = false
22:23:25.124 STDOUT terraform:       + enable_zonal_shift                                           = false
22:23:25.124 STDOUT terraform:       + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
22:23:25.124 STDOUT terraform:       + id                                                           = (known after apply)
22:23:25.124 STDOUT terraform:       + idle_timeout                                                 = 60
22:23:25.124 STDOUT terraform:       + internal                                                     = false
22:23:25.125 STDOUT terraform:       + ip_address_type                                              = (known after apply)
22:23:25.125 STDOUT terraform:       + load_balancer_type                                           = "application"
22:23:25.125 STDOUT terraform:       + name                                                         = "dev-shared-vpc-shared-alb"
22:23:25.125 STDOUT terraform:       + name_prefix                                                  = (known after apply)
22:23:25.125 STDOUT terraform:       + preserve_host_header                                         = false
22:23:25.125 STDOUT terraform:       + region                                                       = "eu-west-1"
22:23:25.125 STDOUT terraform:       + secondary_ips_auto_assigned_per_subnet                       = (known after apply)
22:23:25.125 STDOUT terraform:       + security_groups                                              = (known after apply)
22:23:25.125 STDOUT terraform:       + subnets                                                      = (known after apply)
22:23:25.125 STDOUT terraform:       + tags                                                         = {
22:23:25.125 STDOUT terraform:           + "Environment" = "dev"
22:23:25.125 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.125 STDOUT terraform:           + "Name"        = "dev-shared-vpc-shared-alb"
22:23:25.125 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.125 STDOUT terraform:         }
22:23:25.125 STDOUT terraform:       + tags_all                                                     = {
22:23:25.125 STDOUT terraform:           + "Environment" = "dev"
22:23:25.125 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.125 STDOUT terraform:           + "Name"        = "dev-shared-vpc-shared-alb"
22:23:25.125 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.125 STDOUT terraform:         }
22:23:25.125 STDOUT terraform:       + vpc_id                                                       = (known after apply)
22:23:25.125 STDOUT terraform:       + xff_header_processing_mode                                   = "append"
22:23:25.125 STDOUT terraform:       + zone_id                                                      = (known after apply)
22:23:25.125 STDOUT terraform:       + subnet_mapping (known after apply)
22:23:25.125 STDOUT terraform:     }
22:23:25.125 STDOUT terraform:   # module.vpc.aws_lb_listener.http[0] will be created
22:23:25.125 STDOUT terraform:   + resource "aws_lb_listener" "http" {
22:23:25.125 STDOUT terraform:       + arn                                                                   = (known after apply)
22:23:25.125 STDOUT terraform:       + id                                                                    = (known after apply)
22:23:25.125 STDOUT terraform:       + load_balancer_arn                                                     = (known after apply)
22:23:25.125 STDOUT terraform:       + port                                                                  = 80
22:23:25.125 STDOUT terraform:       + protocol                                                              = "HTTP"
22:23:25.125 STDOUT terraform:       + region                                                                = "eu-west-1"
22:23:25.125 STDOUT terraform:       + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
22:23:25.125 STDOUT terraform:       + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
22:23:25.125 STDOUT terraform:       + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
22:23:25.125 STDOUT terraform:       + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
22:23:25.125 STDOUT terraform:       + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
22:23:25.125 STDOUT terraform:       + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
22:23:25.125 STDOUT terraform:       + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
22:23:25.125 STDOUT terraform:       + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
22:23:25.125 STDOUT terraform:       + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
22:23:25.125 STDOUT terraform:       + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
22:23:25.125 STDOUT terraform:       + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
22:23:25.125 STDOUT terraform:       + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
22:23:25.125 STDOUT terraform:       + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
22:23:25.126 STDOUT terraform:       + routing_http_response_access_control_max_age_header_value             = (known after apply)
22:23:25.126 STDOUT terraform:       + routing_http_response_content_security_policy_header_value            = (known after apply)
22:23:25.126 STDOUT terraform:       + routing_http_response_server_enabled                                  = (known after apply)
22:23:25.126 STDOUT terraform:       + routing_http_response_strict_transport_security_header_value          = (known after apply)
22:23:25.126 STDOUT terraform:       + routing_http_response_x_content_type_options_header_value             = (known after apply)
22:23:25.126 STDOUT terraform:       + routing_http_response_x_frame_options_header_value                    = (known after apply)
22:23:25.126 STDOUT terraform:       + ssl_policy                                                            = (known after apply)
22:23:25.126 STDOUT terraform:       + tags_all                                                              = (known after apply)
22:23:25.126 STDOUT terraform:       + tcp_idle_timeout_seconds                                              = (known after apply)
22:23:25.126 STDOUT terraform:       + default_action {
22:23:25.126 STDOUT terraform:           + order = (known after apply)
22:23:25.126 STDOUT terraform:           + type  = "fixed-response"
22:23:25.126 STDOUT terraform:           + fixed_response {
22:23:25.126 STDOUT terraform:               + content_type = "text/plain"
22:23:25.126 STDOUT terraform:               + message_body = "Not Found"
22:23:25.126 STDOUT terraform:               + status_code  = "404"
22:23:25.126 STDOUT terraform:             }
22:23:25.126 STDOUT terraform:         }
22:23:25.126 STDOUT terraform:       + mutual_authentication (known after apply)
22:23:25.126 STDOUT terraform:     }
22:23:25.126 STDOUT terraform:   # module.vpc.aws_lb_listener_rule.clusters["apps"] will be created
22:23:25.126 STDOUT terraform:   + resource "aws_lb_listener_rule" "clusters" {
22:23:25.126 STDOUT terraform:       + arn          = (known after apply)
22:23:25.126 STDOUT terraform:       + id           = (known after apply)
22:23:25.126 STDOUT terraform:       + listener_arn = (known after apply)
22:23:25.126 STDOUT terraform:       + priority     = 200
22:23:25.126 STDOUT terraform:       + region       = "eu-west-1"
22:23:25.126 STDOUT terraform:       + tags         = {
22:23:25.126 STDOUT terraform:           + "Environment" = "dev"
22:23:25.126 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.126 STDOUT terraform:           + "Name"        = "dev-apps-tg-rule"
22:23:25.126 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.126 STDOUT terraform:         }
22:23:25.126 STDOUT terraform:       + tags_all     = {
22:23:25.126 STDOUT terraform:           + "Environment" = "dev"
22:23:25.126 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.126 STDOUT terraform:           + "Name"        = "dev-apps-tg-rule"
22:23:25.126 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.126 STDOUT terraform:         }
22:23:25.126 STDOUT terraform:       + action {
22:23:25.126 STDOUT terraform:           + order            = (known after apply)
22:23:25.126 STDOUT terraform:           + target_group_arn = (known after apply)
22:23:25.126 STDOUT terraform:           + type             = "forward"
22:23:25.126 STDOUT terraform:         }
22:23:25.126 STDOUT terraform:       + condition {
22:23:25.126 STDOUT terraform:           + host_header {
22:23:25.126 STDOUT terraform:               + regex_values = []
22:23:25.126 STDOUT terraform:               + values       = [
22:23:25.126 STDOUT terraform:                   + "*.dev.example.com",
22:23:25.126 STDOUT terraform:                 ]
22:23:25.126 STDOUT terraform:             }
22:23:25.126 STDOUT terraform:         }
22:23:25.126 STDOUT terraform:     }
22:23:25.126 STDOUT terraform:   # module.vpc.aws_lb_listener_rule.clusters["mgmt"] will be created
22:23:25.126 STDOUT terraform:   + resource "aws_lb_listener_rule" "clusters" {
22:23:25.126 STDOUT terraform:       + arn          = (known after apply)
22:23:25.126 STDOUT terraform:       + id           = (known after apply)
22:23:25.126 STDOUT terraform:       + listener_arn = (known after apply)
22:23:25.126 STDOUT terraform:       + priority     = 100
22:23:25.126 STDOUT terraform:       + region       = "eu-west-1"
22:23:25.126 STDOUT terraform:       + tags         = {
22:23:25.126 STDOUT terraform:           + "Environment" = "dev"
22:23:25.126 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.126 STDOUT terraform:           + "Name"        = "dev-mgmt-tg-rule"
22:23:25.126 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.126 STDOUT terraform:         }
22:23:25.126 STDOUT terraform:       + tags_all     = {
22:23:25.126 STDOUT terraform:           + "Environment" = "dev"
22:23:25.126 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.126 STDOUT terraform:           + "Name"        = "dev-mgmt-tg-rule"
22:23:25.126 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.126 STDOUT terraform:         }
22:23:25.126 STDOUT terraform:       + action {
22:23:25.127 STDOUT terraform:           + order            = (known after apply)
22:23:25.127 STDOUT terraform:           + target_group_arn = (known after apply)
22:23:25.127 STDOUT terraform:           + type             = "forward"
22:23:25.127 STDOUT terraform:         }
22:23:25.127 STDOUT terraform:       + condition {
22:23:25.127 STDOUT terraform:           + host_header {
22:23:25.127 STDOUT terraform:               + regex_values = []
22:23:25.127 STDOUT terraform:               + values       = [
22:23:25.127 STDOUT terraform:                   + "argocd.dev.example.com",
22:23:25.127 STDOUT terraform:                 ]
22:23:25.127 STDOUT terraform:             }
22:23:25.127 STDOUT terraform:         }
22:23:25.127 STDOUT terraform:     }
22:23:25.127 STDOUT terraform:   # module.vpc.aws_lb_target_group.clusters["apps"] will be created
22:23:25.127 STDOUT terraform:   + resource "aws_lb_target_group" "clusters" {
22:23:25.127 STDOUT terraform:       + arn                                = (known after apply)
22:23:25.127 STDOUT terraform:       + arn_suffix                         = (known after apply)
22:23:25.127 STDOUT terraform:       + connection_termination             = (known after apply)
22:23:25.127 STDOUT terraform:       + deregistration_delay               = "300"
22:23:25.127 STDOUT terraform:       + id                                 = (known after apply)
22:23:25.127 STDOUT terraform:       + ip_address_type                    = (known after apply)
22:23:25.127 STDOUT terraform:       + lambda_multi_value_headers_enabled = false
22:23:25.127 STDOUT terraform:       + load_balancer_arns                 = (known after apply)
22:23:25.127 STDOUT terraform:       + load_balancing_algorithm_type      = (known after apply)
22:23:25.127 STDOUT terraform:       + load_balancing_anomaly_mitigation  = (known after apply)
22:23:25.127 STDOUT terraform:       + load_balancing_cross_zone_enabled  = (known after apply)
22:23:25.127 STDOUT terraform:       + name                               = "dev-apps-tg"
22:23:25.127 STDOUT terraform:       + name_prefix                        = (known after apply)
22:23:25.127 STDOUT terraform:       + port                               = 80
22:23:25.127 STDOUT terraform:       + preserve_client_ip                 = (known after apply)
22:23:25.127 STDOUT terraform:       + protocol                           = "HTTP"
22:23:25.127 STDOUT terraform:       + protocol_version                   = (known after apply)
22:23:25.127 STDOUT terraform:       + proxy_protocol_v2 
22:23:25.127 STDOUT terraform:                  = false
22:23:25.127 STDOUT terraform:       + region                             = "eu-west-1"
22:23:25.127 STDOUT terraform:       + slow_start                         = 0
22:23:25.127 STDOUT terraform:       + tags                               = {
22:23:25.127 STDOUT terraform:           + "Environment" = "dev"
22:23:25.127 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.127 STDOUT terraform:           + "Name"        = "dev-apps-tg"
22:23:25.127 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.127 STDOUT terraform:         }
22:23:25.127 STDOUT terraform:       + tags_all                           = {
22:23:25.127 STDOUT terraform:           + "Environment" = "dev"
22:23:25.127 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.127 STDOUT terraform:           + "Name"        = "dev-apps-tg"
22:23:25.127 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.127 STDOUT terraform:         }
22:23:25.127 STDOUT terraform:       + target_type                        = "ip"
22:23:25.127 STDOUT terraform:       + vpc_id                             = (known after apply)
22:23:25.127 STDOUT terraform:       + health_check {
22:23:25.127 STDOUT terraform:           + enabled             = true
22:23:25.127 STDOUT terraform:           + healthy_threshold   = 2
22:23:25.127 STDOUT terraform:           + interval            = 30
22:23:25.127 STDOUT terraform:           + matcher             = "200"
22:23:25.127 STDOUT terraform:           + path                = "/healthz"
22:23:25.127 STDOUT terraform:           + port                = "traffic-port"
22:23:25.127 STDOUT terraform:           + protocol            = "HTTP"
22:23:25.127 STDOUT terraform:           + timeout             = 5
22:23:25.127 STDOUT terraform:           + unhealthy_threshold = 2
22:23:25.127 STDOUT terraform:         }
22:23:25.127 STDOUT terraform:       + stickiness (known after apply)
22:23:25.127 STDOUT terraform:       + target_failover (known after apply)
22:23:25.127 STDOUT terraform:       + target_group_health (known after apply)
22:23:25.127 STDOUT terraform:       + target_health_state (known after apply)
22:23:25.127 STDOUT terraform:     }
22:23:25.127 STDOUT terraform:   # module.vpc.aws_lb_target_group.clusters["mgmt"] will be created
22:23:25.127 STDOUT terraform:   + resource "aws_lb_target_group" "clusters" {
22:23:25.127 STDOUT terraform:       + arn                                = (known after apply)
22:23:25.127 STDOUT terraform:       + arn_suffix                         = (known after apply)
22:23:25.128 STDOUT terraform:       + connection_termination             = (known after apply)
22:23:25.128 STDOUT terraform:       + deregistration_delay               = "300"
22:23:25.128 STDOUT terraform:       + id                                 = (known after apply)
22:23:25.128 STDOUT terraform:       + ip_address_type                    = (known after apply)
22:23:25.128 STDOUT terraform:       + lambda_multi_value_headers_enabled = false
22:23:25.128 STDOUT terraform:       + load_balancer_arns                 = (known after apply)
22:23:25.128 STDOUT terraform:       + load_balancing_algorithm_type      = (known after apply)
22:23:25.128 STDOUT terraform:       + load_balancing_anomaly_mitigation  = (known after apply)
22:23:25.128 STDOUT terraform:       + load_balancing_cross_zone_enabled  = (known after apply)
22:23:25.128 STDOUT terraform:       + name                               = "dev-mgmt-tg"
22:23:25.128 STDOUT terraform:       + name_prefix                        = (known after apply)
22:23:25.128 STDOUT terraform:       + port                               = 80
22:23:25.128 STDOUT terraform:       + preserve_client_ip                 = (known after apply)
22:23:25.128 STDOUT terraform:       + protocol                           = "HTTP"
22:23:25.128 STDOUT terraform:       + protocol_version                   = (known after apply)
22:23:25.128 STDOUT terraform:       + proxy_protocol_v2                  = false
22:23:25.128 STDOUT terraform:       + region                             = "eu-west-1"
22:23:25.128 STDOUT terraform:       + slow_start                         = 0
22:23:25.128 STDOUT terraform:       + tags                               = {
22:23:25.128 STDOUT terraform:           + "Environment" = "dev"
22:23:25.128 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.128 STDOUT terraform:           + "Name"        = "dev-mgmt-tg"
22:23:25.128 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.128 STDOUT terraform:         }
22:23:25.128 STDOUT terraform:       + tags_all                           = {
22:23:25.128 STDOUT terraform:           + "Environment" = "dev"
22:23:25.128 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.128 STDOUT terraform:           + "Name"        = "dev-mgmt-tg"
22:23:25.128 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.128 STDOUT terraform:         }
22:23:25.128 STDOUT terraform:       + target_type                        = "ip"
22:23:25.128 STDOUT terraform:       + vpc_id                             = (known after apply)
22:23:25.128 STDOUT terraform:       + health_check {
22:23:25.128 STDOUT terraform:           + enabled             = true
22:23:25.128 STDOUT terraform:           + healthy_threshold   = 2
22:23:25.128 STDOUT terraform:           + interval            = 30
22:23:25.128 STDOUT terraform:           + matcher             = "200"
22:23:25.128 STDOUT terraform:           + path                = "/healthz"
22:23:25.128 STDOUT terraform:           + port                = "traffic-port"
22:23:25.128 STDOUT terraform:           + protocol            = "HTTP"
22:23:25.128 STDOUT terraform:           + timeout             = 5
22:23:25.128 STDOUT terraform:           + unhealthy_threshold = 2
22:23:25.128 STDOUT terraform:         }
22:23:25.128 STDOUT terraform:       + stickiness (known after apply)
22:23:25.128 STDOUT terraform:       + target_failover (known after apply)
22:23:25.128 STDOUT terraform:       + target_group_health (known after apply)
22:23:25.128 STDOUT terraform:       + target_health_state (known after apply)
22:23:25.128 STDOUT terraform:     }
22:23:25.128 STDOUT terraform:   # module.vpc.aws_nat_gateway.main will be created
22:23:25.128 STDOUT terraform:   + resource "aws_nat_gateway" "main" {
22:23:25.128 STDOUT terraform:       + allocation_id                      = (known after apply)
22:23:25.128 STDOUT terraform:       + association_id                     = (known after apply)
22:23:25.128 STDOUT terraform:       + auto_provision_zones               = (known after apply)
22:23:25.128 STDOUT terraform:       + auto_scaling_ips                   = (known after apply)
22:23:25.128 STDOUT terraform:       + availability_mode                  = (known after apply)
22:23:25.128 STDOUT terraform:       + connectivity_type                  = "public"
22:23:25.128 STDOUT terraform:       + id                                 = (known after apply)
22:23:25.128 STDOUT terraform:       + network_interface_id               = (known after apply)
22:23:25.128 STDOUT terraform:       + private_ip                         = (known after apply)
22:23:25.128 STDOUT terraform:       + public_ip                          = (known after apply)
22:23:25.128 STDOUT terraform:       + region                             = "eu-west-1"
22:23:25.128 STDOUT terraform:       + regional_nat_gateway_address       = (known after apply)
22:23:25.128 STDOUT terraform:       + regional_nat_gateway_auto_mode     = (known after apply)
22:23:25.128 STDOUT terraform:       + route_table_id                     = (known after apply)
22:23:25.129 STDOUT terraform:       + secondary_allocation_ids           = (known after apply)
22:23:25.129 STDOUT terraform:       + secondary_private_ip_address_count = (known after apply)
22:23:25.129 STDOUT terraform:       + secondary_private_ip_addresses     = (known after apply)
22:23:25.129 STDOUT terraform:       + subnet_id                          = (known after apply)
22:23:25.129 STDOUT terraform:       + tags                               = {
22:23:25.129 STDOUT terraform:           + "Environment" = "dev"
22:23:25.129 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.129 STDOUT terraform:           + "Name"        = "dev-shared-vpc-nat"
22:23:25.129 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.129 STDOUT terraform:         }
22:23:25.129 STDOUT terraform:       + tags_all                           = {
22:23:25.129 STDOUT terraform:           + "Environment" = "dev"
22:23:25.129 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.129 STDOUT terraform:           + "Name"        = "dev-shared-vpc-nat"
22:23:25.129 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.129 STDOUT terraform:         }
22:23:25.129 STDOUT terraform:       + vpc_id                             = (known after apply)
22:23:25.129 STDOUT terraform:     }
22:23:25.129 STDOUT terraform:   # module.vpc.aws_route_table.private will be created
22:23:25.129 STDOUT terraform:   + resource "aws_route_table" "private" {
22:23:25.129 STDOUT terraform:       + arn              = (known after apply)
22:23:25.129 STDOUT terraform:       + id               = (known after apply)
22:23:25.129 STDOUT terraform:       + owner_id         = (known after apply)
22:23:25.129 STDOUT terraform:       + propagating_vgws = (known after apply)
22:23:25.129 STDOUT terraform:       + region           = "eu-west-1"
22:23:25.129 STDOUT terraform:       + route            = [
22:23:25.129 STDOUT terraform:           + {
22:23:25.129 STDOUT terraform:               + cidr_block                 = "0.0.0.0/0"
22:23:25.129 STDOUT terraform:               + nat_gateway_id             = (known after apply)
22:23:25.129 STDOUT terraform:                 # (11 unchanged attributes hidden)
22:23:25.129 STDOUT terraform:             },
22:23:25.129 STDOUT terraform:         ]
22:23:25.129 STDOUT terraform:       + tags             = {
22:23:25.129 STDOUT terraform:           + "Environment" = "dev"
22:23:25.129 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.129 STDOUT terraform:           + "Name"        = "dev-shared-vpc-private-rt"
22:23:25.129 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.129 STDOUT terraform:         }
22:23:25.129 STDOUT terraform:       + tags_all         = {
22:23:25.129 STDOUT terraform:           + "Environment" = "dev"
22:23:25.129 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.129 STDOUT terraform:           + "Name"        = "dev-shared-vpc-private-rt"
22:23:25.129 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.129 STDOUT terraform:         }
22:23:25.129 STDOUT terraform:       + vpc_id           = (known after apply)
22:23:25.129 STDOUT terraform:     }
22:23:25.129 STDOUT terraform:   # module.vpc.aws_route_table.public will be created
22:23:25.129 STDOUT terraform:   + resource "aws_route_table" "public" {
22:23:25.129 STDOUT terraform:       + arn              = (known after apply)
22:23:25.129 STDOUT terraform:       + id               = (known after apply)
22:23:25.129 STDOUT terraform:       + owner_id         = (known after apply)
22:23:25.129 STDOUT terraform:       + propagating_vgws = (known after apply)
22:23:25.129 STDOUT terraform:       + region           = "eu-west-1"
22:23:25.129 STDOUT terraform:       + route            = [
22:23:25.129 STDOUT terraform:           + {
22:23:25.129 STDOUT terraform:               + cidr_block                 = "0.0.0.0/0"
22:23:25.129 STDOUT terraform:               + gateway_id                 = (known after apply)
22:23:25.129 STDOUT terraform:                 # (11 unchanged attributes hidden)
22:23:25.129 STDOUT terraform:             },
22:23:25.129 STDOUT terraform:         ]
22:23:25.129 STDOUT terraform:       + tags             = {
22:23:25.129 STDOUT terraform:           + "Environment" = "dev"
22:23:25.129 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.129 STDOUT terraform:           + "Name"        = "dev-shared-vpc-public-rt"
22:23:25.129 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.129 STDOUT terraform:         }
22:23:25.129 STDOUT terraform:       + tags_all         = {
22:23:25.129 STDOUT terraform:           + "Environment" = "dev"
22:23:25.129 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.129 STDOUT terraform:           + "Name"        = "dev-shared-vpc-public-rt"
22:23:25.129 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.129 STDOUT terraform:         }
22:23:25.129 STDOUT terraform:       + vpc_id           = (known after apply)
22:23:25.129 STDOUT terraform:     }
22:23:25.129 STDOUT terraform:   # module.vpc.aws_route_table_association.private["eu-west-1a"] will be created
22:23:25.129 STDOUT terraform:   + resource "aws_route_table_association" "private" {
22:23:25.129 STDOUT terraform:       + id             = (known after apply)
22:23:25.130 STDOUT terraform:       + region         = "eu-west-1"
22:23:25.130 STDOUT terraform:       + route_table_id = (known after apply)
22:23:25.130 STDOUT terraform:       + subnet_id      = (known after apply)
22:23:25.130 STDOUT terraform:     }
22:23:25.130 STDOUT terraform:   # module.vpc.aws_route_table_association.private["eu-west-1b"] will be created
22:23:25.130 STDOUT terraform:   + resource "aws_route_table_association" "private" {
22:23:25.130 STDOUT terraform:       + id             = (known after apply)
22:23:25.130 STDOUT terraform:       + region         = "eu-west-1"
22:23:25.130 STDOUT terraform:       + route_table_id = (known after apply)
22:23:25.130 STDOUT terraform:       + subnet_id      = (known after apply)
22:23:25.130 STDOUT terraform:     }
22:23:25.130 STDOUT terraform:   # module.vpc.aws_route_table_association.public["eu-west-1a"] will be created
22:23:25.130 STDOUT terraform:   + resource "aws_route_table_association" "public" {
22:23:25.130 STDOUT terraform:       + id             = (known after apply)
22:23:25.130 STDOUT terraform:       + region         = "eu-west-1"
22:23:25.130 STDOUT terraform:       + route_table_id = (known after apply)
22:23:25.130 STDOUT terraform:       + subnet_id      = (known after apply)
22:23:25.130 STDOUT terraform:     }
22:23:25.130 STDOUT terraform:   # module.vpc.aws_route_table_association.public["eu-west-1b"] will be created
22:23:25.130 STDOUT terraform:   + resource "aws_route_table_association" "public" {
22:23:25.130 STDOUT terraform:       + id             = (known after apply)
22:23:25.130 STDOUT terraform:       + region         = "eu-west-1"
22:23:25.130 STDOUT terraform:       + route_table_id = (known after apply)
22:23:25.130 STDOUT terraform:       + subnet_id      = (known after apply)
22:23:25.130 STDOUT terraform:     }
22:23:25.130 STDOUT terraform:   # module.vpc.aws_security_group.alb[0] will be created
22:23:25.130 STDOUT terraform:   + resource "aws_security_group" "alb" {
22:23:25.130 STDOUT terraform:       + arn                    = (known after apply)
22:23:25.130 STDOUT terraform:       + description            = "Security group for shared Application Load Balancer"
22:23:25.130 STDOUT terraform:       + egress                 = [
22:23:25.130 STDOUT terraform:           + {
22:23:25.130 STDOUT terraform:               + cidr_blocks      = [
22:23:25.130 STDOUT terraform:                   + "0.0.0.0/0",
22:23:25.130 STDOUT terraform:                 ]
22:23:25.130 STDOUT terraform:               + description      = "Allow all outbound"
22:23:25.130 STDOUT terraform:               + from_port        = 0
22:23:25.130 STDOUT terraform:               + ipv6_cidr_blocks = []
22:23:25.130 STDOUT terraform:               + prefix_list_ids  = []
22:23:25.130 STDOUT terraform:               + protocol         = "-1"
22:23:25.130 STDOUT terraform:               + security_groups  = []
22:23:25.130 STDOUT terraform:               + self             = false
22:23:25.130 STDOUT terraform:               + to_port          = 0
22:23:25.130 STDOUT terraform:             },
22:23:25.130 STDOUT terraform:         ]
22:23:25.130 STDOUT terraform:       + id                     = (known after apply)
22:23:25.130 STDOUT terraform:       + ingress                = [
22:23:25.130 STDOUT terraform:           + {
22:23:25.130 STDOUT terraform:               + cidr_blocks      = [
22:23:25.130 STDOUT terraform:                   + "0.0.0.0/0",
22:23:25.130 STDOUT terraform:                 ]
22:23:25.130 STDOUT terraform:               + description      = "HTTP from internet"
22:23:25.130 STDOUT terraform:               + from_port        = 80
22:23:25.130 STDOUT terraform:               + ipv6_cidr_blocks = []
22:23:25.130 STDOUT terraform:               + prefix_list_ids  = []
22:23:25.130 STDOUT terraform:               + protocol         = "tcp"
22:23:25.130 STDOUT terraform:               + security_groups  = []
22:23:25.130 STDOUT terraform:               + self             = false
22:23:25.130 STDOUT terraform:               + to_port          = 80
22:23:25.130 STDOUT terraform:             },
22:23:25.130 STDOUT terraform:           + {
22:23:25.130 STDOUT terraform:               + cidr_blocks      = [
22:23:25.130 STDOUT terraform:                   + "0.0.0.0/0",
22:23:25.130 STDOUT terraform:                 ]
22:23:25.130 STDOUT terraform:               + description      = "HTTPS from internet"
22:23:25.130 STDOUT terraform:               + from_port        = 443
22:23:25.130 STDOUT terraform:               + ipv6_cidr_blocks = []
22:23:25.130 STDOUT terraform:               + prefix_list_ids  = []
22:23:25.130 STDOUT terraform:               + protocol         = "tcp"
22:23:25.130 STDOUT terraform:               + security_groups  = []
22:23:25.130 STDOUT terraform:               + self             = false
22:23:25.130 STDOUT terraform:               + to_port          = 443
22:23:25.130 STDOUT terraform:             },
22:23:25.130 STDOUT terraform:         ]
22:23:25.130 STDOUT terraform:       + name                   = "dev-shared-vpc-alb-sg"
22:23:25.130 STDOUT terraform:       + name_prefix            = (known after apply)
22:23:25.130 STDOUT terraform:       + owner_id               = (known after apply)
22:23:25.131 STDOUT terraform:       + region                 = "eu-west-1"
22:23:25.131 STDOUT terraform:       + revoke_rules_on_delete = false
22:23:25.131 STDOUT terraform:       + tags                   = {
22:23:25.131 STDOUT terraform:           + "Environment" = "dev"
22:23:25.131 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.131 STDOUT terraform:           + "Name"        = "dev-shared-vpc-alb-sg"
22:23:25.131 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.131 STDOUT terraform:         }
22:23:25.131 STDOUT terraform:       + tags_all               = {
22:23:25.131 STDOUT terraform:           + "Environment" = "dev"
22:23:25.131 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.131 STDOUT terraform:           + "Name"        = "dev-shared-vpc-alb-sg"
22:23:25.131 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.131 STDOUT terraform:         }
22:23:25.131 STDOUT terraform:       + vpc_id                 = (known after apply)
22:23:25.131 STDOUT terraform:     }
22:23:25.131 STDOUT terraform:   # module.vpc.aws_subnet.private["eu-west-1a"] will be created
22:23:25.131 STDOUT terraform:   + resource "aws_subnet" "private" {
22:23:25.131 STDOUT terraform:       + arn                                            = (known after apply)
22:23:25.131 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
22:23:25.131 STDOUT terraform:       + availability_zone                              = "eu-west-1a"
22:23:25.131 STDOUT terraform:       + availability_zone_id                           = (known after apply)
22:23:25.131 STDOUT terraform:       + cidr_block                                     = "10.0.11.0/24"
22:23:25.131 STDOUT terraform:       + enable_dns64                                   = false
22:23:25.131 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
22:23:25.131 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
22:23:25.131 STDOUT terraform:       + id                                             = (known after apply)
22:23:25.131 STDOUT terraform:       + ipv6_cidr_block                                = (known after apply)
22:23:25.131 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
22:23:25.131 STDOUT terraform:       + ipv6_native                                    = false
22:23:25.131 STDOUT terraform:       + map_public_ip_on_launch                        = false
22:23:25.131 STDOUT terraform:       + owner_id                                       = (known after apply)
22:23:25.131 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
22:23:25.131 STDOUT terraform:       + region                                         = "eu-west-1"
22:23:25.131 STDOUT terraform:       + tags                                           = {
22:23:25.131 STDOUT terraform:           + "Environment"                     = "dev"
22:23:25.131 STDOUT terraform:           + "ManagedBy"                       = "terraform"
22:23:25.131 STDOUT terraform:           + "Name"                            = "dev-shared-vpc-private-eu-west-1a"
22:23:25.131 STDOUT terraform:           + "Project"                         = "platform-foundation"
22:23:25.131 STDOUT terraform:           + "kubernetes.io/role/internal-elb" = "1"
22:23:25.131 STDOUT terraform:         }
22:23:25.131 STDOUT terraform:       + tags_all                                       = {
22:23:25.131 STDOUT terraform:           + "Environment"                     = "dev"
22:23:25.131 STDOUT terraform:           + "ManagedBy"                       = "terraform"
22:23:25.131 STDOUT terraform:           + "Name"                            = "dev-shared-vpc-private-eu-west-1a"
22:23:25.131 STDOUT terraform:           + "Project"                         = "platform-foundation"
22:23:25.131 STDOUT terraform:           + "kubernetes.io/role/internal-elb" = "1"
22:23:25.131 STDOUT terraform:         }
22:23:25.131 STDOUT terraform:       + vpc_id                                         = (known after apply)
22:23:25.131 STDOUT terraform:     }
22:23:25.131 STDOUT terraform:   # module.vpc.aws_subnet.private["eu-west-1b"] will be created
22:23:25.131 STDOUT terraform:   + resource "aws_subnet" "private" {
22:23:25.131 STDOUT terraform:       + arn                                            = (known after apply)
22:23:25.131 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
22:23:25.131 STDOUT terraform:       + availability_zone                              = "eu-west-1b"
22:23:25.131 STDOUT terraform:       + availability_zone_id                           = (known after apply)
22:23:25.131 STDOUT terraform:       + cidr_block                                     = "10.0.12.0/24"
22:23:25.131 STDOUT terraform:       + enable_dns64                                   = false
22:23:25.131 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
22:23:25.132 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
22:23:25.132 STDOUT terraform:       + id                                             = (known after apply)
22:23:25.132 STDOUT terraform:       + ipv6_cidr_block                                = (known after apply)
22:23:25.132 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
22:23:25.132 STDOUT terraform:       + ipv6_native                                    = false
22:23:25.132 STDOUT terraform:       + map_public_ip_on_launch                        = false
22:23:25.132 STDOUT terraform:       + owner_id                                       = (known after apply)
22:23:25.132 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
22:23:25.132 STDOUT terraform:       + region                                         = "eu-west-1"
22:23:25.132 STDOUT terraform:       + tags                                           = {
22:23:25.132 STDOUT terraform:           + "Environment"                     = "dev"
22:23:25.132 STDOUT terraform:           + "ManagedBy"                       = "terraform"
22:23:25.132 STDOUT terraform:           + "Name"                            = "dev-shared-vpc-private-eu-west-1b"
22:23:25.132 STDOUT terraform:           + "Project"                         = "platform-foundation"
22:23:25.132 STDOUT terraform:           + "kubernetes.io/role/internal-elb" = "1"
22:23:25.132 STDOUT terraform:         }
22:23:25.132 STDOUT terraform:       + tags_all                                       = {
22:23:25.132 STDOUT terraform:           + "Environment"                     = "dev"
22:23:25.132 STDOUT terraform:           + "ManagedBy"                       = "terraform"
22:23:25.132 STDOUT terraform:           + "Name"                            = "dev-shared-vpc-private-eu-west-1b"
22:23:25.132 STDOUT terraform:           + "Project"                         = "platform-foundation"
22:23:25.132 STDOUT terraform:           + "kubernetes.io/role/internal-elb" = "1"
22:23:25.132 STDOUT terraform:         }
22:23:25.132 STDOUT terraform:       + vpc_id                                         = (known after apply)
22:23:25.132 STDOUT terraform:     }
22:23:25.132 STDOUT terraform:   # module.vpc.aws_subnet.public["eu-west-1a"] will be created
22:23:25.132 STDOUT terraform:   + resource "aws_subnet" "public" {
22:23:25.132 STDOUT terraform:       + arn                                            = (known after apply)
22:23:25.132 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
22:23:25.132 STDOUT terraform:       + availability_zone                              = "eu-west-1a"
22:23:25.132 STDOUT terraform:       + availability_zone_id                           = (known after apply)
22:23:25.132 STDOUT terraform:       + cidr_block                                     = "10.0.1.0/24"
22:23:25.132 STDOUT terraform:       + enable_dns64                                   = false
22:23:25.133 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
22:23:25.133 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
22:23:25.133 STDOUT terraform:       + id                                             = (known after apply)
22:23:25.133 STDOUT terraform:       + ipv6_cidr_block                                = (known after apply)
22:23:25.133 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
22:23:25.133 STDOUT terraform:       + ipv6_native                                    = false
22:23:25.133 STDOUT terraform:       + map_public_ip_on_launch                        = true
22:23:25.133 STDOUT terraform:       + owner_id                                       = (known after apply)
22:23:25.134 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
22:23:25.135 STDOUT terraform:       + region                                         = "eu-west-1"
22:23:25.135 STDOUT terraform:       + tags                                           = {
22:23:25.135 STDOUT terraform:           + "Environment"            = "dev"
22:23:25.135 STDOUT terraform:           + "ManagedBy"              = "terraform"
22:23:25.135 STDOUT terraform:           + "Name"                   = "dev-shared-vpc-public-eu-west-1a"
22:23:25.135 STDOUT terraform:           + "Project"                = "platform-foundation"
22:23:25.135 STDOUT terraform:           + "kubernetes.io/role/elb" = "1"
22:23:25.135 STDOUT terraform:         }
22:23:25.135 STDOUT terraform:       + tags_all                                       = {
22:23:25.135 STDOUT terraform:           + "Environment"            = "dev"
22:23:25.135 STDOUT terraform:           + "ManagedBy"              = "terraform"
22:23:25.135 STDOUT terraform:           + "Name"                   = "dev-shared-vpc-public-eu-west-1a"
22:23:25.135 STDOUT terraform:           + "Project"                = "platform-foundation"
22:23:25.135 STDOUT terraform:           + "kubernetes.io/role/elb" = "1"
22:23:25.135 STDOUT terraform:         }
22:23:25.135 STDOUT terraform:       + vpc_id                                         = (known after apply)
22:23:25.135 STDOUT terraform:     }
22:23:25.135 STDOUT terraform:   # module.vpc.aws_subnet.public["eu-west-1b"] will be created
22:23:25.135 STDOUT terraform:   + resource "aws_subnet" "public" {
22:23:25.135 STDOUT terraform:       + arn                                            = (known after apply)
22:23:25.135 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
22:23:25.135 STDOUT terraform:       + availability_zone                              = "eu-west-1b"
22:23:25.135 STDOUT terraform:       + availability_zone_id                           = (known after apply)
22:23:25.135 STDOUT terraform:       + cidr_block                                     = "10.0.2.0/24"
22:23:25.135 STDOUT terraform:       + enable_dns64                                   = false
22:23:25.135 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
22:23:25.135 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
22:23:25.135 STDOUT terraform:       + id                                             = (known after apply)
22:23:25.135 STDOUT terraform:       + ipv6_cidr_block                                = (known after apply)
22:23:25.135 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
22:23:25.136 STDOUT terraform:       + ipv6_native                                    = false
22:23:25.136 STDOUT terraform:       + map_public_ip_on_launch                        = true
22:23:25.136 STDOUT terraform:       + owner_id                                       = (known after apply)
22:23:25.136 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
22:23:25.136 STDOUT terraform:       + region                                         = "eu-west-1"
22:23:25.136 STDOUT terraform:       + tags                                           = {
22:23:25.136 STDOUT terraform:           + "Environment"            = "dev"
22:23:25.136 STDOUT terraform:           + "ManagedBy"              = "terraform"
22:23:25.136 STDOUT terraform:           + "Name"                   = "dev-shared-vpc-public-eu-west-1b"
22:23:25.136 STDOUT terraform:           + "Project"                = "platform-foundation"
22:23:25.136 STDOUT terraform:           + "kubernetes.io/role/elb" = "1"
22:23:25.136 STDOUT terraform:         }
22:23:25.136 STDOUT terraform:       + tags_all                                       = {
22:23:25.136 STDOUT terraform:           + "Environment"            = "dev"
22:23:25.136 STDOUT terraform:           + "ManagedBy"              = "terraform"
22:23:25.136 STDOUT terraform:           + "Name"                   = "dev-shared-vpc-public-eu-west-1b"
22:23:25.136 STDOUT terraform:           + "Project"                = "platform-foundation"
22:23:25.136 STDOUT terraform:           + "kubernetes.io/role/elb" = "1"
22:23:25.136 STDOUT terraform:         }
22:23:25.136 STDOUT terraform:       + vpc_id                                         = (known after apply)
22:23:25.136 STDOUT terraform:     }
22:23:25.136 STDOUT terraform:   # module.vpc.aws_vpc.main will be created
22:23:25.136 STDOUT terraform:   + resource "aws_vpc" "main" {
22:23:25.136 STDOUT terraform:       + arn                                  = (known after apply)
22:23:25.136 STDOUT terraform:       + cidr_block                           = "10.0.0.0/16"
22:23:25.136 STDOUT terraform:       + default_network_acl_id               = (known after apply)
22:23:25.136 STDOUT terraform:       + default_route_table_id               = (known after apply)
22:23:25.136 STDOUT terraform:       + default_security_group_id            = (known after apply)
22:23:25.136 STDOUT terraform:       + dhcp_options_id                      = (known after apply)
22:23:25.136 STDOUT terraform:       + enable_dns_hostnames                 = true
22:23:25.136 STDOUT terraform:       + enable_dns_support                   = true
22:23:25.136 STDOUT terraform:       + enable_network_address_usage_metrics = (known after apply)
22:23:25.136 STDOUT terraform:       + id                                   = (known after apply)
22:23:25.137 STDOUT terraform:       + instance_tenancy                     = "default"
22:23:25.137 STDOUT terraform:       + ipv6_association_id                  = (known after apply)
22:23:25.137 STDOUT terraform:       + ipv6_cidr_block                      = (known after apply)
22:23:25.137 STDOUT terraform:       + ipv6_cidr_block_network_border_group = (known after apply)
22:23:25.137 STDOUT terraform:       + main_route_table_id                  = (known after apply)
22:23:25.137 STDOUT terraform:       + owner_id                             = (known after apply)
22:23:25.137 STDOUT terraform:       + region                               = "eu-west-1"
22:23:25.137 STDOUT terraform:       + tags                                 = {
22:23:25.137 STDOUT terraform:           + "Environment" = "dev"
22:23:25.137 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.137 STDOUT terraform:           + "Name"        = "dev-shared-vpc"
22:23:25.137 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.137 STDOUT terraform:         }
22:23:25.137 STDOUT terraform:       + tags_all                             = {
22:23:25.137 STDOUT terraform:           + "Environment" = "dev"
22:23:25.137 STDOUT terraform:           + "ManagedBy"   = "terraform"
22:23:25.137 STDOUT terraform:           + "Name"        = "dev-shared-vpc"
22:23:25.137 STDOUT terraform:           + "Project"     = "platform-foundation"
22:23:25.137 STDOUT terraform:         }
22:23:25.137 STDOUT terraform:     }
22:23:25.137 STDOUT terraform: Plan: 52 to add, 0 to change, 0 to destroy.
22:23:25.137 STDOUT terraform: Changes to Outputs:
22:23:25.137 STDOUT terraform:   + alb_dns_name              = (known after apply)
22:23:25.137 STDOUT terraform:   + eks_apps_cluster_endpoint = (known after apply)
22:23:25.137 STDOUT terraform:   + eks_mgmt_cluster_endpoint = (known after apply)
22:23:25.137 STDOUT terraform:   + vpc_id                    = (known after apply)

```

</details>

---
**Plan artifact:** `tfplan-3-0540c53ecbeaea69766cccde27a0f013deb30d2e` (7-day GitHub retention)
**Plan S3 location:** `s3://iac-foundation-tf-state/terraform-plans/3/0540c53ecbeaea69766cccde27a0f013deb30d2e/` (14-day S3 lifecycle)
**Note:**
- Plans with changes stored in both GitHub artifacts (7d) and S3 (14d).
- Plans with no changes don't generate binary files (nothing to apply).
- Infrastructure uses environment parameterization (dev.tfvars).

**Deployment order:** Organizations (manual) → GitHub OIDC → Dev Infrastructure
**Organizations:** Managed locally with admin credentials for security.
*Pusher: @richardnpaul, Action: `pull_request`, Workflow: `Terraform Deployment`*